000010 PROGRAM-ID. DateMain.
000020 ENVIRONMENT DIVISION.
000030 CONFIGURATION SECTION.
000040 REPOSITORY.
000050     CLASS FJ-JAVA-CONTROL
000060     CLASS J-System as "java-lang-System"
000070     CLASS J-Date as "java-util-Date"
000080     CLASS J-Printstream as "java-io-PrintStream"
000090     .
000100 DATA DIVISION.
000110 WORKING-STORAGE SECTION.
000120 01  aDate OBJECT REFERENCE J-Date.
000130 PROCEDURE DIVISION.
000140     INVOKE FJ-JAVA-CONTROL "JVM-INIT".
000150     INVOKE J-Date "Create-Date-01" RETURNING aDate.
000160     INVOKE JF-OUT OF J-System "println" USING CONTENT aDate.
000170     INVOKE FJ-JAVA-CONTROL "JVM-TERMINATE".
000180 END PROGRAM DATEMAIN.
