000010* Copyright 1999-2015 FUJITSU LIMITED
000020  01 ProductTable.
000030    02 ProductTablevalues.
000040      03 .
000050        04 PIC X(10) VALUE "FMV2TXH111".
000060        04 PIC X(32) VALUE "FMV-6450TX2".
000070        04 PIC X(32) VALUE "WindowsNT".
000080        04 PIC 9(09) VALUE 428000.
000090        04 PIC X(10) VALUE "FMV2TXH161".
000100        04 PIC X(32) VALUE "FMV-6450TX2".
000110        04 PIC X(32) VALUE "Windows98".
000120        04 PIC 9(09) VALUE 408000.
000130        04 PIC X(10) VALUE "FMV2TXH151".
000140        04 PIC X(32) VALUE "FMV-6450TX2".
000150        04 PIC X(32) VALUE "Windows95".
000160        04 PIC 9(09) VALUE 408000.
000170      03 .
000180        04 PIC X(10) VALUE "FMV2TXF111".
000190        04 PIC X(32) VALUE "FMV-6400TX2".
000200        04 PIC X(32) VALUE "WindowsNT".
000210        04 PIC 9(09) VALUE 368000.
000220        04 PIC X(10) VALUE "FMV2TXF161".
000230        04 PIC X(32) VALUE "FMV-6400TX2".
000240        04 PIC X(32) VALUE "Windows98".
000250        04 PIC 9(09) VALUE 348000.
000260        04 PIC X(10) VALUE "FMV2TXF151".
000270        04 PIC X(32) VALUE "FMV-6400TX2".
000280        04 PIC X(32) VALUE "Windows95".
000290        04 PIC 9(09) VALUE 348000.
000300      03 .
000310        04 PIC X(10) VALUE "FMV2DXH111".
000320        04 PIC X(32) VALUE "FMV-6450DX2".
000330        04 PIC X(32) VALUE "WindowsNT".
000340        04 PIC 9(09) VALUE 398000.
000350        04 PIC X(10) VALUE "FMV2DXH161".
000360        04 PIC X(32) VALUE "FMV-6450DX2".
000370        04 PIC X(32) VALUE "Windows98".
000380        04 PIC 9(09) VALUE 378000.
000390        04 PIC X(10) VALUE "FMV2DXH151".
000400        04 PIC X(32) VALUE "FMV-6450DX2".
000410        04 PIC X(32) VALUE "Windows95".
000420        04 PIC 9(09) VALUE 378000.
000430      03 .
000440        04 PIC X(10) VALUE "FMV2DXF111".
000450        04 PIC X(32) VALUE "FMV-6400DX2".
000460        04 PIC X(32) VALUE "WindowsNT".
000470        04 PIC 9(09) VALUE 338000.
000480        04 PIC X(10) VALUE "FMV2DXF161".
000490        04 PIC X(32) VALUE "FMV-6400DX2".
000500        04 PIC X(32) VALUE "Windows98".
000510        04 PIC 9(09) VALUE 318000.
000520        04 PIC X(10) VALUE "FMV2DXF151".
000530        04 PIC X(32) VALUE "FMV-6400DX2".
000540        04 PIC X(32) VALUE "Windows95".
000550        04 PIC 9(09) VALUE 318000.
000560      03 .
000570        04 PIC X(10) VALUE "FMV2DXD111".
000580        04 PIC X(32) VALUE "FMV-6350DX2".
000590        04 PIC X(32) VALUE "WindowsNT".
000600        04 PIC 9(09) VALUE 278000.
000610        04 PIC X(10) VALUE "FMV2DXD161".
000620        04 PIC X(32) VALUE "FMV-6350DX2".
000630        04 PIC X(32) VALUE "Windows98".
000640        04 PIC 9(09) VALUE 258000.
000650        04 PIC X(10) VALUE "FMV2DXD151".
000660        04 PIC X(32) VALUE "FMV-6350DX2".
000670        04 PIC X(32) VALUE "Windows95".
000680        04 PIC 9(09) VALUE 258000.
000690      03 .
000700        04 PIC X(10) VALUE "FMV2DXA111".
000710        04 PIC X(32) VALUE "FMV-6366DX2c".
000720        04 PIC X(32) VALUE "WindowsNT".
000730        04 PIC 9(09) VALUE 238000.
000740        04 PIC X(10) VALUE "FMV2DXA161".
000750        04 PIC X(32) VALUE "FMV-6366DX2c".
000760        04 PIC X(32) VALUE "Windows98".
000770        04 PIC 9(09) VALUE 218000.
000780        04 PIC X(10) VALUE "FMV2DXA151".
000790        04 PIC X(32) VALUE "FMV-6366DX2c".
000800        04 PIC X(32) VALUE "Windows95".
000810        04 PIC 9(09) VALUE 218000.
000820      03 .
000830        04 PIC X(10) VALUE "FMV3NA3LC0".
000840        04 PIC X(32) VALUE "FMV-6366NA3/L".
000850        04 PIC X(32) VALUE "WindowsNT".
000860        04 PIC 9(09) VALUE 648000.
000870        04 PIC X(10) VALUE "FMV3NA3LC6".
000880        04 PIC X(32) VALUE "FMV-6366NA3/L".
000890        04 PIC X(32) VALUE "Windows98".
000900        04 PIC 9(09) VALUE 628000.
000910    02 productEntry redefines ProductTablevalues occurs 20 times.
000920      03 P-NUM            pic X(10).
000930      03 P-Name           pic X(32).
000940      03 P-Model          pic X(32).
000950      03 P-Price          pic 9(09).
000960   02 P-QUANT             pic 9(10) occurs 20 times.
