000100*=================================================================
000200* 「マルチスレッドプログラミング」
000300*     スレッド間でファイル・データを共用してオンラインショッピング
000400*   のアプリケーションを構築します。
000500*
000600*=================================================================
000700*
000800*  ファイル名： Shutdown.cob
000900*  動作概要  ： オンラインショッピングの開始処理を行います
001000*
001100* Copyright 1999-2015 FUJITSU LIMITED
001200*=================================================================
001300 identification division.
001400 program-id. "HttpExtensionProc".
001500 environment division.
001600 data division.
001700 working-storage section.
001800     copy COBW3.
001900*
002000 01 returnValue                    pic 9(09) comp-5.
002100 01 HTMLFilename                   pic X(40).
002200 01 copyStartPos                   pic 9(05).
002300 01 leftLength                     pic 9(05).
002400 01 オンラインショッピング起動情報 pic 9(1) is external.
002500*----------------------------------------------------------------*
002600* SAFアプリへの移行について                                      *
002700*                                                                *
002800*    SAFアプリに移行する際は、連絡節と手続き部を修正する必要が   *
002900*  あります。インタフェース領域をSAFサブルーチンで使用するため、 *
003000*  SAFサブルーチンとのインタフェースであるCOBW3にそのアドレス    *
003100*  を設定する必要があります。                                    *
003200*                                                                *
003300*  [補足]                                                        *
003400*    SAFアプリの場合は、NSAPI開始から終了までのコメントを外し、  *
003500*  ISAPI開始から終了までをコメント化してください。               *
003600*    SAFアプリのリンク～実行の詳細については"COBOL Webサブルー   *
003700*  チン使用手引書" を参照してください                            *
003800*                                                                *
003900*----------------------------------------------------------------*
004000*
004100*---------------------   ＩＳＡＰＩ 開始  -----------------------*
004200 linkage section.
004300     copy IsapiCtx.
004400*
004500 procedure division with stdcall linkage using ISAPI-CTX-CNT.
004600*
004700 Auth-Start.
004800*
004900*  ＩＳＡＰＩサブルーチンパラメタ域の初期化
005000     move low-value to COBW3.
005100     move function addr(ISAPI-CTX-CNT) to COBW3-CONTEXT.
005200*---------------------   ＩＳＡＰＩ 終了  -----------------------*
005300*
005400*---------------------   ＮＳＡＰＩ 開始  -----------------------*
005500*linkage section.
005600*01 safpt                         pointer.
005700**
005800* procedure division using safpt.
005900**
006000*Auth-Start.
006100**
006200**  ＮＳＡＰＩサブルーチンパラメタ域の初期化
006300*    move low-value to COBW3.
006400*    move safpt     to COBW3-CONTEXT.
006500*---------------------   ＮＳＡＰＩ 終了  -----------------------*
006600*
006700*=================================================================
006800*  Ｗｅｂサブルーチン作業環境の設定し、Ｗｅｂパラメタを獲得する
006900*=================================================================
007000     call "COBW3_INIT" using COBW3.
007100*
007200*=================================================================
007300*  オンラインショッピングの停止
007400*=================================================================
007500     call "オンラインショッピング停止"
007600          returning returnValue
007700*
007800*=================================================================
007900*  結果出力用ページの選択
008000*=================================================================
008100*  編集画面の選定
008200     evaluate returnValue
008300       when   zero
008400         move "Shutdown.html" to HTMLFilename
008500       when   1
008600         move "SysError.html" to HTMLFilename
008700       when   2
008800         move "NotOpened.html" to HTMLFilename
008900     end-evaluate.
009000*=================================================================
009100* 画面出力処理
009200*   アプリケーションが配置されている物理パスの取得して、出力する
009300*  HTML文書名を完成させる
009400*=================================================================
009500     set COBW3-PHYSICALPATH to true.
009600     call "COBW3_GET_REQUEST_INFO" using COBW3.
009700     if COBW3-STATUS = zero then
009800       move space to COBW3-HTML-FILENAME
009900       string COBW3-REQUEST-INFO(1:COBW3-REQUEST-INFO-LENGTH)
010000              "\"                    delimited by size
010100              HTMLFilename           delimited by space
010200          into COBW3-HTML-FILENAME
010300     end-if.
010400*  HTML文書の出力
010500     call "COBW3_PUT_HTML" using COBW3.
010600*=================================================================
010700*  Ｗｅｂサブルーチン作業領域の解放
010800     call "COBW3_FREE" using COBW3.
010900*=================================================================
011000*
011100 StartOnline-End.
011200*
011300     move 1 to program-status.
011400     exit program.
