000100*************************************************************************
000200**  Copyright 1999-2015 FUJITSU LIMITED
000300**
000400**    User-Log.cbl
000500**
000600*************************************************************************
000700* USING 句に指定するデータ項目
000800 01  userLog global.
000900   02   イベント番号       PIC  9(9)  COMP-5.
001000   02   種類               PIC  9(4)  COMP-5.
001100*    種類に格納する値
001200     88  情報              VALUE 0.
001300     88  警告              VALUE 1.
001400     88  エラー            VALUE 2.
001500   02                      PIC  9(4)  COMP-5.
001600   02   データ.
001700     03    データ長        PIC  9(9)  COMP-5.
001800     03    データアドレス  POINTER.
001900   02   エラー詳細情報     PIC  9(9)  COMP-5.
002000   02                      PIC  9(9)  COMP-5.
002100   02   ソース名           PIC  X(256).
002200   02   説明               PIC  X(1024).
002300
002400* RETURNING句に指定するデータ項目
002500 01  復帰コード           PIC S9(9)  COMP-5.
