000100**************************************************************************
000200** Copyright 1999-2015 FUJITSU LIMITED
000300**
000400**  user-Lock.cbl
000500**
000600**************************************************************************
000700 01 lock-key   global pic x(30).
000800 01 wait-time  global pic s9(9) comp-5.
000900 01 err-datail global pic 9(9)  comp-5.
001000 01 ret-value  global pic s9(9) comp-5.
