000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   SUMCALC.
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060   77  WSS-AG1    PIC S9(8) BINARY.
000070   77  WSS-AG2    PIC S9(4) BINARY.
000080   77  WSS-AG3  PIC S9(8) BINARY.
000090   77  WSS-AG4    PIC S9(4) BINARY.
000100   77  WSS-AG5      PIC S9(4) BINARY.
000110   77  WSS-AG6     PIC S9(4) BINARY.
000120   77  WSS-AG7     PIC S9(4) BINARY.
000130   01  GROUP4.
000140      02  GROUP4-V1     PIC X(24)
000150                   VALUE  "312831303130313130313031".
000160      02  GROUP4-V2     REDEFINES GROUP4-V1
000170                   PIC 99 OCCURS 12 TIMES.
000180*
000190 LINKAGE SECTION.
000200   01  入力日付.
000210         03  年  PIC 9999.
000220         03  月  PIC 99.
000230         03  日  PIC 99.
000240   01  LK-VALUE  PIC S9(8)  BINARY.
000250*
000260 PROCEDURE DIVISION  USING 入力日付 LK-VALUE.
000270*
000280* 前年までの?uうるう年?vを?l慮する?D
000290     COMPUTE WSS-AG3 = (年 - 1900 - 1) / 4.
000300* 前年までの通算日付を??める?B
000310     COMPUTE WSS-AG1 = (年 - 1900) * 365 + WSS-AG3.
000320*
000330* 入力された年がうるう年かどうか判定する
000340     DIVIDE 年 BY 4   GIVING WSS-AG4 REMAINDER WSS-AG5.
000350     DIVIDE 年 BY 100 GIVING WSS-AG4 REMAINDER WSS-AG6.
000360     DIVIDE 年 BY 400 GIVING WSS-AG4 REMAINDER WSS-AG7.
000370*
000380* 年が４の倍?狽ﾅ?Aかつ100の倍?狽ﾅなければ閏年
000390* ただし?A400の倍?狽ﾌ年も閏年
000400     IF WSS-AG5 = 0 THEN
000410       IF WSS-AG6 NOT = 0 OR
000420           WSS-AG7    = 0 THEN
000430         MOVE "29" TO GROUP4-V2(2)
000440       END-IF
000450     END-IF.
000460*
000470* 入力された年の月を計算してGROUP4-V1にする.
000480     PERFORM  VARYING WSS-AG2 FROM 1 BY 1 UNTIL WSS-AG2 = 月
000490       COMPUTE WSS-AG1 = WSS-AG1 + GROUP4-V2(WSS-AG2)
000500     END-PERFORM.
000510*
000520* GROUP4-V1を計算する.
000530     COMPUTE LK-VALUE = WSS-AG1 + 日.
000540*
000550     EXIT PROGRAM.
000560 END PROGRAM  SUMCALC.