000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   CheckRecord.
000060 DATA DIVISION.
000070 WORKING-STORAGE SECTION.
000072 01 LIST.			
000073 		02 LIST-AMPE PIC X(12) VALUE "152025304050".
000074 		02 AMPES	REDEFINES  LIST-AMPE  PIC 99 OCCURS 6 TIMES.
000075 		02 LIST-CATEGORY		PIC X(3)  VALUE "ACD".	 	 
000076 		02 CATEGORIES	REDEFINES  LIST-CATEGORY PIC X OCCURS 3 TIMES.
000077 		
000078 01 COUNT-ARRAY.
000079 		02 COUNT-AMPE	PIC 9.
000080 		02 COUNT-CATE	PIC 9.
000081 
000084 01 CHECK.
000085 		02 CHECK-AMPE	PIC X VALUE "F".
000086 		02 CHECK-CATE	PIC X VALUE "F".		
000087 LINKAGE SECTION.
000088  01 BILL-INPUTL.
000089 		02 BILL-IDL		PIC X(5).
000090 		02 AMPEL		PIC X(2).
000091 		02 PRE-MONTHL 	PIC X(4).
000092 		02 CUR-MONTHL	PIC X(4).
000093 		02 CATEGORYL	PIC X(1).
000094 		02 ENDEDL		PIC X(1).
000095 		02 				PIC X(63).				
000096 	01 CHECKL PIC X. 	
000097 PROCEDURE DIVISION USING BILL-INPUTL CHECKL.
000098 CHECK-RECORD.
000099 		IF BILL-IDL IS NUMERIC AND 100001 <= BILL-IDL AND BILL-IDL <= 79999 AND 
000100 		PRE-MONTHL IS NUMERIC AND CUR-MONTHL IS NUMERIC AND PRE-MONTHL <= CUR-MONTHL
000101 		AND ENDEDL = "*"  
000102 		THEN
000103 		    PERFORM CHECK-AMPEF
000104 		    PERFORM CHECK-CATEGORYF
000105 		    MOVE "T" TO CHECKL
000106 		ELSE
000107 		    MOVE "F" TO CHECKL
000108 		END-IF
000109 		PERFORM STOP-PROGRAM.
000110 END-CHECK-RECORD.
000111 
000112 CHECK-AMPEF.
000113 		PERFORM VARYING COUNT-AMPE FROM 1 BY 1 UNTIL COUNT-AMPE > 6
000114 			IF AMPEL = AMPES(COUNT-AMPE) THEN
000115 			    MOVE "T" TO CHECK-AMPE 
000116 			    CONTINUE
000117 			END-IF
000118 		END-PERFORM
000119 		IF CHECK-AMPE = "F" THEN
000120 		    MOVE "F" TO CHECKL
000121 			PERFORM STOP-PROGRAM
000122 		END-IF.
000123 		
000124 		
000125  CHECK-CATEGORYF.
000126 		PERFORM VARYING COUNT-CATE FROM 1 BY 1 UNTIL COUNT-CATE > 3
000127 			IF CATEGORYL = CATEGORIES(COUNT-CATE) THEN
000128 			    MOVE "T" TO CHECK-CATE 
000129 			    CONTINUE
000130 			END-IF
000131 		END-PERFORM
000132 		IF CHECK-CATE = "F" THEN
000133 		    MOVE "F" TO CHECKL
000134 			PERFORM STOP-PROGRAM
000135 		END-IF.		
000136 END-CHECK-AMPE.
000137 STOP-PROGRAM.
000138 		EXIT PROGRAM.
000139 END-STOP-PROGRAM.
000140 END PROGRAM CheckRecord.