000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   Example2.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000051 INPUT-OUTPUT SECTION.
000052 FILE-CONTROL.
000053 		SELECT BILL-INPUTF ASSIGN TO "INPUTD.txt"
000054      ORGANIZATION IS LINE SEQUENTIAL.
000055      SELECT BILL-LISTF ASSIGN TO "OUTLIST.txt"
000056      ORGANIZATION IS LINE SEQUENTIAL.
000057      SELECT BILL-TAPEF ASSIGN TO "OUTTAP.txt"
000058      ORGANIZATION IS LINE SEQUENTIAL.
000059      
000060 DATA DIVISION.
000061 FILE SECTION.
000062 FD BILL-INPUTF.
000063 01 BILL-INPUT.
000064 		02 BILL-ID		PIC X(5).
000065 		02 AMPE			PIC X(2).
000066 		02 PRE-MONTH 	PIC X(4).
000067 		02 CUR-MONTH	PIC X(4).
000068 		02 CATEGORY		PIC X(1).
000069 		02 ENDED		PIC X(1).
000070 		02				PIC X(63).
000071 	
000072 FD BILL-LISTF.
000073 01 BILL-LIST.
000074 		02 LIST-WRITE	PIC X(120).
000075 FD BILL-TAPEF.
000076 01 BILL-TAP.
000077 		02 TAP-WRITE	PIC X(100).
000078  
000079 
000080 		
000081 WORKING-STORAGE SECTION.
000082 01 CHECK.
000083 		02 CHECK-EOF 	PIC X 	VALUE "F".
000084 		02 CHECK-RECORD PIC X.
000085 01 BILL-LIST-DISPLAY.
000086 		02 				PIC X(9) VALUE SPACE.
000087 		02 ORDER-L		PIC zz9  BLANK WHEN ZERO.
000088 		02				PIC X(6) VALUE SPACE.		
000089 		02 ERROR-L		PIC X(3).
000090 		02      		PIC X(8) VALUE SPACE.
000091 		02 BILL			PIC X(80).
000092 						
000093 01 BILL-TAPE-DISPLAY.
000094 		02 				PIC X(9) VALUE SPACE.
000095 		02 BILL-IDT		PIC X(5).
000096 		02 				PIC X(2) VALUE SPACE.
000097 		02 AMPET		PIC X(2).
000098 		02 				PIC X(2) VALUE SPACE.
000099 		02 PRE-MONTHT 	PIC X(4).
000100 		02 				PIC X(2) VALUE SPACE.
000101 		02 CUR-MONTHT	PIC X(4).
000102 01 COUNT-VALUE.
000103 		02 COUNT-RECORD PIC 9(3) VALUE 0.		
000104 		
000105 PROCEDURE DIVISION.
000106 MAIN-PROGRAM.
000107 		PERFORM INIT-PROGRAM
000108 		PERFORM MAIN-PROCESS UNTIL CHECK-EOF = "T"
000109 		PERFORM END-PROGRAM
000110 		STOP RUN.
000111 END-MAIN-PROGRAM.
000112**************************** 
000113 INIT-PROGRAM.
000114 		OPEN INPUT BILL-INPUTF
000115 		OPEN OUTPUT BILL-LISTF BILL-TAPEF
000116 		PERFORM INPUT-BILLF.
000117************************** 		
000118 MAIN-PROCESS.
000119 		COMPUTE COUNT-RECORD = COUNT-RECORD + 1
000120 		CALL "CheckRecord"  USING BILL-INPUT CHECK-RECORD.
000121		PERFORM WRITE-BILL-LIST
000122		PERFORM INPUT-BILLF.
000123 END-MAIN-PROCESS.
000124************************** 
000125 END-PROGRAM.
000126 		CLOSE BILL-INPUTF
000127 		CLOSE BILL-LISTF BILL-TAPEF.
000128 END-END-PROGRAM.
000129************************* 
000130 INPUT-BILLF.
000131		 READ BILL-INPUTF
000132		         AT END 
000133		         	MOVE "T" TO CHECK-EOF
000134		 END-READ.
000135 END-INPUT-BILLF.  
000136 
000137*************************** 
000138 WRITE-BILL-LIST.
000139 		MOVE COUNT-RECORD TO ORDER-L
000140 		IF CHECK-RECORD = "F" THEN
000141 		    MOVE "-*-" TO ERROR-L
000142 		ELSE
000143 			MOVE "   " TO ERROR-L    
000144 		END-IF
000145 		
000146 		MOVE BILL-INPUT TO BILL.
000147 		WRITE BILL-LIST FROM BILL-LIST-DISPLAY.
000148 END-WRITE-BILL-LIST.
000149********************************  
000150 END PROGRAM Example2.