000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   Example2.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000051 INPUT-OUTPUT SECTION.
000052 FILE-CONTROL.
000053 		SELECT BILL-INPUTF ASSIGN TO "INPUT.txt"
000054      ORGANIZATION IS LINE SEQUENTIAL.
000055      SELECT BILL-LISTF ASSIGN TO "OUTLIST.txt"
000056      ORGANIZATION IS LINE SEQUENTIAL.
000057      SELECT BILL-TAPEF ASSIGN TO "OUTTAP.txt"
000058      ORGANIZATION IS LINE SEQUENTIAL.
000059      
000060 DATA DIVISION.
000061 FILE SECTION.
000062 FD BILL-INPUTF.
000063 01 BILL-INPUT.
000064 		02 BILL-ID		PIC X(5).
000065 		02 AMPE			PIC X(2).
000066 		02 PRE-MONTH 	PIC X(4).
000067 		02 CUR-MONTH	PIC X(4).
000068 		02 CATEGORY		PIC X(1).
000069 	
000070 FD BILL-LISTF.
000071 01 BILL-LIST.
000072 		02 LIST-WRITE	PIC X(120).
000073 FD BILL-TAPEF.
000074 01 BILL-TAP.
000075 		02 TAP-WRITE	PIC X(100).
000076  
000077 
000078 		
000079 WORKING-STORAGE SECTION.
000080 01 CHECK.
000081 		02 CHECK-EOF 	PIC X VALUE "F".
000082 		02 CHECK-RECORD PIC X.
000083 01 BILL-LIST-DISPLAY.
000084 		02 				PIC X(9) VALUE SPACE.
000085 		02 ORDER-B		PIC zz9  BLANK WHEN ZERO.
000086 		02				PIC X(6) VALUE SPACE.		
000087 		02 ERROR-B		PIC X(3).
000088 		02      		PIC X(8) VALUE SPACE.
000089 		02 BILL			PIC X(80).
000090 						
000091 01 BILL-TAPE-DISPLAY.
000092 		02 				PIC X(9) VALUE SPACE.
000093 		02 BILL-IDT		PIC X(5).
000094 		02 				PIC X(2) VALUE SPACE.
000095 		02 AMPET		PIC X(2).
000096 		02 				PIC X(2) VALUE SPACE.
000097 		02 PRE-MONTHT 	PIC X(4).
000098 		02 				PIC X(2) VALUE SPACE.
000099 		02 CUR-MONTHT	PIC X(4).
000100 			
000101 PROCEDURE DIVISION.
000102 MAIN-PROGRAM.
000103 		PERFORM INIT-PROGRAM
000104 		PERFORM MAIN-PROCESS UNTIL CHECK-EOF = "T"
000105 		PERFORM END-PROGRAM
000106 		STOP RUN.
000107 END-MAIN-PROGRAM.
000108 
000109 INIT-PROGRAM.
000110 		OPEN INPUT BILL-INPUTF
000111 		OPEN OUTPUT BILL-LISTF BILL-TAPEF.
000112 		
000113 MAIN-PROCESS.
000114 		CALL "CheckRecord"  USING BILL-INPUT CHECK-RECORD.
000115 END-MAIN-PROCESS.
000116 
000117 END-PROGRAM.
000118 		CLOSE BILL-INPUTF
000119 		CLOSE BILL-LISTF BILL-TAPEF.
000120 END-END-PROGRAM.
000121  PRODUCT-INPUT.
000122		 READ BILL-INPUTF
000123		         AT END 
000124		         	MOVE "T" TO CHECK-EOF
000125		 END-READ.
000126 END-PRODUCT-INPUT.    
000130 END PROGRAM Example2.