000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   Example2.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000051 INPUT-OUTPUT SECTION.
000052 FILE-CONTROL.
000053 		SELECT BILL-INPUTF ASSIGN TO "INPUT.txt"
000054      ORGANIZATION IS LINE SEQUENTIAL.
000055      SELECT BILL-LISTF ASSIGN TO PRINTER.
000057      SELECT BILL-TAPEF ASSIGN TO "OUTTAP.txt"
000058      ORGANIZATION IS LINE SEQUENTIAL.
000059      
000060 DATA DIVISION.
000061 FILE SECTION.
000062 FD BILL-INPUTF.
000063 01 BILL-INPUT.
000064 		02 BILL-ID		PIC X(5).
000065 		02 AMPE			PIC X(2).
000066 		02 PRE-MONTH 	PIC X(4).
000067 		02 CUR-MONTH	PIC X(4).
000068 		02 CATEGORY		PIC X(1).
000069 		02 ENDED		PIC X(1).
000070 		02				PIC X(63).
000071 	
000072 FD BILL-LISTF.
000073 01 BILL-LIST.
000074 		02 LIST-WRITE	PIC X(120).
000075 FD BILL-TAPEF.
000076 01 BILL-TAPE.
000077 		02 TAP-WRITE	PIC X(100).
000078  
000079 
000080 		
000081 WORKING-STORAGE SECTION.
000082 01 CHECK.
000083 		02 CHECK-EOF 	PIC X 		VALUE "F".
000084 		02 CHECK-RECORD PIC X.
000085*****電気使用量リストのリコードを指示する******* 		
000086 01 BILL-LIST-DISPLAY.
000087 		02 				PIC X(9) 	VALUE SPACE.
000088 		02 ORDER-L		PIC zz9  	BLANK WHEN ZERO.
000089 		02				PIC X(6) 	VALUE SPACE.		
000090 		02 ERROR-L		PIC X(3).
000091 		02      		PIC X(8) 	VALUE SPACE.
000092 		02 BILL			PIC X(80).
000093*******電気使用量テープのリコードを指示する********* 						
000094 01 BILL-TAPE-DISPLAY.
000095 		02 				PIC X(9) 	VALUE SPACE.
000096 		02 BILL-IDT		PIC X(5).
000097 		02 				PIC X(2) 	VALUE SPACE.
000098 		02 AMPET		PIC X(2).
000099 		02 				PIC X(2) 	VALUE SPACE.
000100 		02 PRE-MONTHT 	PIC X(4).
000101 		02 				PIC X(2) 	VALUE SPACE.
000102 		02 CUR-MONTHT	PIC X(4).
000103 		02				PIC X(2) 	VALUE SPACE.
000104 		02 CATEGORYT	PIC X(1).
000105******電気使用量リストのタイトルを指示する************ 		
000106 01 LIST-TITLE.
000107 		02				PIC X(10) 	VALUE SPACE.
000108 		02				PIC X(2)  	VALUE "NO".
000109 		02				PIC X(5)	VALUE 	SPACE.
000110 		02 				PIC X(5)	VALUE "ERROR".
000111 		02				PIC X(8)	VALUE SPACE.
000112 		02				PIC X(41)	VALUE "* * Electricity Usage List * * ".
000113 		
000114 01 BILL-TITLE.
000115 		02				PIC X(17)	VALUE SPACE.
000116 		02				PIC X(41)	VALUE "* * Electricity Usage List * * ".		
000117 01 COUNT-VALUE.
000118 		02 COUNT-RECORD PIC 9(3) VALUE 0.
000119 		02 COUNT-NEXTPAGE	PIC 9(2) VALUE 0.		
000120 		
000121 PROCEDURE DIVISION.
000122 MAIN-PROGRAM.
000123 		PERFORM INIT-PROGRAM
000124 		PERFORM MAIN-PROCESS UNTIL CHECK-EOF = "T"
000125 		PERFORM END-PROGRAM
000126 		STOP RUN.
000127 END-MAIN-PROGRAM.
000128**************************** 
000129 INIT-PROGRAM.
000130 		OPEN INPUT BILL-INPUTF
000131 		OPEN OUTPUT BILL-LISTF BILL-TAPEF
000132 		WRITE BILL-LIST FROM BILL-TITLE AFTER 5 LINE.
000133 		WRITE BILL-LIST FROM LIST-TITLE AFTER 2 LINE.
000134 		PERFORM INPUT-BILLF.
000135*******主要な処理********			
000136 MAIN-PROCESS.
000137 		COMPUTE COUNT-RECORD = COUNT-RECORD + 1
000138 		CALL "CheckRecord"  USING BILL-INPUT CHECK-RECORD.
000139 		IF CHECK-RECORD = "T" THEN
000140 		    PERFORM WRITE-BILL-TAPE
000143 		END-IF
000144		PERFORM WRITE-BILL-LIST
000145		PERFORM INPUT-BILLF
000146		COMPUTE COUNT-NEXTPAGE = COUNT-NEXTPAGE + 1.
000147 END-MAIN-PROCESS.
000148************************** 
000149 END-PROGRAM.
000150 		CLOSE BILL-INPUTF
000151 		CLOSE BILL-LISTF BILL-TAPEF.
000152 END-END-PROGRAM.
000153******EOFをチェックする******* 
000154 INPUT-BILLF.
000155		 READ BILL-INPUTF
000156		         AT END 
000157		         	MOVE "T" TO CHECK-EOF
000158		 END-READ.
000159 END-INPUT-BILLF.  
000160 
000161*****電気使用量リストにデータを入力する******** 
000162 WRITE-BILL-LIST.
000163 		MOVE COUNT-RECORD TO ORDER-L
000164 		IF CHECK-RECORD = "F" THEN
000165 		    MOVE "-*-" TO ERROR-L
000166 		ELSE
000167 			MOVE "   " TO ERROR-L    
000168 		END-IF
000169 		
000170 		MOVE BILL-INPUT TO BILL
000171 		
000172 		PERFORM WRITE-NEXT-PAGE
000173 		
000176 		WRITE BILL-LIST FROM BILL-LIST-DISPLAY AFTER 2 LINE.
000177 END-WRITE-BILL-LIST.
000178*
000179****電気使用量テープにデータを入力する*******
000180 WRITE-BILL-TAPE.
000181 	    MOVE BILL-ID TO BILL-IDT
000182 		MOVE AMPE TO AMPET
000183 		MOVE PRE-MONTH TO PRE-MONTHT
000184 		MOVE CUR-MONTH TO CUR-MONTHT
000185 		MOVE CATEGORY TO CATEGORYT
000186 		WRITE BILL-TAPE FROM BILL-TAPE-DISPLAY.	
000187 END-WRITE-BILL-TAPE.
000188*
000189****リコードの数量＞２０の時新しいページを移動します******
000190 WRITE-NEXT-PAGE.
000191		IF COUNT-NEXTPAGE = 10 THEN
000192 			MOVE 0 TO COUNT-NEXTPAGE
000193 		    PERFORM WRITE-HEAD-PAGE
000194  	END-IF.
000195 END-WRITE-NEXT-PAGE.
000196*
000197*****タイトルを入力する*********
000198 WRITE-HEAD-PAGE.
000199 	   MOVE SPACE TO BILL-LIST
000200 	   WRITE BILL-LIST AFTER PAGE
000201 	   WRITE BILL-LIST FROM BILL-TITLE AFTER 4 LINE
000202 	   WRITE BILL-LIST FROM LIST-TITLE AFTER 2 LINE.			
000203 END-WRITE-HEAD-PAGE.
000204*
000209 END PROGRAM Example2.