000100*========================================================================
000200*　仕様クラス
000300*                                   －サンプルプログラム「会議室予約」－
000400*
000500*　　仕様単位の情報について、固有なデータ及びメソッドを持つ。
000600*
000700*　〇継承クラス
000800*　　１）FJBASE
000900*
001000*　〇オブジェクトデータ
001100*　　１）仕様データ　　　　　　　－　TYPE 仕様リスト
001200*
001300*　〇オブジェクトメソッド
001400*　　１）仕様設定
001500*　　２）仕様参照
001600*
001700*            Copyright 1999-2015 FUJITSU LIMITED
001800*========================================================================
001900 IDENTIFICATION  DIVISION.
002000 CLASS-ID.   仕様クラス  INHERITS FJBASE.
002100 ENVIRONMENT     DIVISION.
002200 CONFIGURATION   SECTION.
002300 REPOSITORY.
002400     CLASS FJBASE
002500     .
002600 FACTORY.
002700 END FACTORY.
002800*
002900 OBJECT.
003000 DATA DIVISION.
003100 BASED-STORAGE   SECTION.
003200  COPY SPECINFO.
003300 WORKING-STORAGE SECTION.
003400  01  仕様データ                  TYPE 仕様リスト.
003500 PROCEDURE       DIVISION.
003600*========================================================================
003700*　仕様設定メソッド
003800*
003900*　　仕様情報を設定する。
004000*
004100*　〇入力：仕様データ (TYPE 仕様リスト)
004200*　〇出力：なし
004300*========================================================================
004400 METHOD-ID.  仕様設定.
004500 DATA            DIVISION.
004600 LINKAGE         SECTION.
004700  01 Ｌ－仕様データ               TYPE 仕様リスト.
004800 PROCEDURE       DIVISION
004900                    USING         Ｌ－仕様データ.
005000     MOVE  Ｌ－仕様データ         TO  仕様データ
005100 END METHOD 仕様設定.
005200*========================================================================
005300*　仕様参照メソッド
005400*
005500*　　仕様情報を取得する。
005600*
005700*　〇入力：なし
005800*　〇出力：仕様データ (TYPE 仕様リスト)
005900*========================================================================
006000 METHOD-ID.    仕様参照.
006100 DATA            DIVISION.
006200 LINKAGE         SECTION.
006300  01 Ｌ－仕様データ               TYPE 仕様リスト.
006400 PROCEDURE       DIVISION
006500                    RETURNING     Ｌ－仕様データ.
006600     MOVE  仕様データ             TO  Ｌ－仕様データ
006700 END METHOD 仕様参照.
006800 END OBJECT.
006900 END CLASS  仕様クラス.
