000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   Example1.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000051 INPUT-OUTPUT SECTION.
000052 FILE-CONTROL.
000054 		SELECT PRODUCTFILE ASSIGN TO "PRODUCT1.txt"
000056           ORGANIZATION IS LINE SEQUENTIAL.
000057      SELECT WRITEFILE ASSIGN TO "RESULTS.txt"
000058           ORGANIZATION IS LINE SEQUENTIAL.     
000060 DATA DIVISION.
000061 FILE SECTION.
000062
000063 FD PRODUCTFILE.
000064 01 PRODUCT.
000065 		88  END-OF-PRODUCTFILE  VALUE HIGH-VALUES.
000066		02  PRODUCT-ID       PIC X(4).
000067 		02  PRODUCT-NAME		  PIC X(20).
000068 		02  PRODUCT-PRICE      PIC 9(4).
000069 		02  PRODUCT-AMOUNT     PIC 9(3).
000070 FD WRITEFILE.		
000072 01 WRITE-PRODUCT.
000073 		02 	WRITE-STRING PIC X(71).	
000074 		
000075 WORKING-STORAGE SECTION.
000076 01 COST.
000077 		02 COST-PRODUCT PIC 9(9) VALUE 0.
000078 		02 COST-ALL PIC 9(10) VALUE 0.
000079 		02 COST-GROUP PIC 9(10) VALUE 0.
000080 01 COUNT-PRODUCT.
000081 		02 COUNT-ALL PIC 9(3) VALUE 0.
000082 		02 COUNT-ERROR PIC 9(3) VALUE 0.	
000083 		02 COUNT-NORMAL PIC 9(3).	
000084 01 CHECK-GROUP PIC X.
000085 01 SUM-PART PIC 9(10) VALUE 0.
000086 
000087 01 TEMP-STRING PIC X(40).
000088 01 DISPLAY-SCREEN.
000089 		02 DISPLAY-GROUP PIC X(37) VALUE "                          GROUP-COST:".
000090 		02 DISPLAY-ERROR PIC X(13) VALUE " >>>>>> ERROR".
000091 		02 DISPLAY-TOTALCOST PIC X(39) VALUE "                                Total: ".
000092 		02 DISPLAY-TOTALPRODUCT PIC X(14) VALUE "PRODUCT TOTAL:".
000093 		02 DISPLAY-TOTALPRODUCT-ERROR PIC X(15) VALUE "PRODUCT ERROR :".
000094 		02 DISPLAY-TOTALPRODUCT-NORMAL PIC X(15) VALUE "PRODUCT NORMAL:".
000095 PROCEDURE DIVISION.
000096 MAIN-PROGRAM.
000097 		PERFORM MAIN-PROCESS
000098 		PERFORM DISPLAY-RESULT
000099		STOP RUN.
000100 
000101 
000102 MAIN-PROCESS.
000103     OPEN INPUT PRODUCTFILE.
000104     OPEN OUTPUT WRITEFILE.
000105     READ PRODUCTFILE
000106         AT END SET END-OF-PRODUCTFILE TO TRUE
000107     END-READ
000108    
000109     PERFORM UNTIL END-OF-PRODUCTFILE
000110     ADD 1 TO COUNT-ALL
000111*     PERFORM COUNT-GROUP-FUNCTION
000112	   IF COUNT-ALL = 1	 THEN
000113	       MOVE PRODUCT-ID(1:1) TO CHECK-GROUP	
000114	   END-IF 
000115	   
000116	   IF PRODUCT-PRICE IS NUMERIC AND PRODUCT-AMOUNT IS NUMERIC THEN
000117	       MULTIPLY PRODUCT-PRICE BY PRODUCT-AMOUNT GIVING COST-PRODUCT
000118	       
000119	       IF CHECK-GROUP = PRODUCT-ID(1:1) THEN
000120	           ADD COST-PRODUCT TO COST-GROUP
000121	       ELSE
000122	       	   DISPLAY DISPLAY-GROUP CHECK-GROUP SPACE COST-GROUP
000123	       	   
000124	       	   PERFORM WRITE-GROUP-PRODUCT
000132	       	   
000133	           MOVE PRODUCT-ID(1:1) TO CHECK-GROUP
000134	           MOVE COST-PRODUCT TO COST-GROUP
000135	       END-IF
000136	       
000137    	   DISPLAY PRODUCT-ID SPACE PRODUCT-NAME SPACE PRODUCT-PRICE 
000138    	   SPACE PRODUCT-AMOUNT SPACE COST-PRODUCT
000139    	   PERFORM WRITE-CORRECT-PRODUCT
000140    	   
000143    	   ADD COST-PRODUCT TO COST-ALL
000144	   ELSE
000145	   	   ADD 1 TO COUNT-ERROR
000146	   	   IF CHECK-GROUP NOT EQUAL PRODUCT-ID(1:1) THEN
000147	   	       DISPLAY DISPLAY-GROUP CHECK-GROUP SPACE  COST-GROUP
000148	   	       
000149	   	       PERFORM WRITE-GROUP-PRODUCT
000156	   	       
000157	   	       MOVE PRODUCT-ID(1:1) TO CHECK-GROUP
000158	   	       MOVE 0 TO COST-GROUP
000159	   	       
000160	   	   END-IF
000161	       DISPLAY PRODUCT-ID SPACE PRODUCT-NAME DISPLAY-ERROR
000162	       PERFORM WRITE-ERROR-PRODUCT
000163	   END-IF	
000164     
000165     READ PRODUCTFILE
000166             AT END SET END-OF-PRODUCTFILE TO TRUE
000167     END-READ
000168     
000169     END-PERFORM
000170     DISPLAY DISPLAY-GROUP CHECK-GROUP SPACE  COST-GROUP	
000171     PERFORM WRITE-GROUP-PRODUCT
000177     
000178     CLOSE WRITEFILE.
000179     CLOSE PRODUCTFILE.
000180     
000181 WRITE-GROUP-PRODUCT.
000182 		MOVE " " TO WRITE-STRING	
000183 		STRING DISPLAY-GROUP DELIMITED BY SIZE
000184					CHECK-GROUP DELIMITED BY SPACE
000185					' '   DELIMITED BY SIZE
000186					COST-GROUP DELIMITED BY SPACE
000187					INTO WRITE-STRING
000188			   END-STRING
000189 	    WRITE WRITE-PRODUCT. 
000190 WRITE-ERROR-PRODUCT.
000191		MOVE " " TO WRITE-STRING	
000192  	STRING PRODUCT-ID DELIMITED BY SIZE
000193  		   ' '   DELIMITED BY SIZE
000194			   PRODUCT-NAME DELIMITED BY SIZE
000195			   DISPLAY-ERROR DELIMITED BY SIZE
000196			   INTO WRITE-STRING
000197	    END-STRING	    
000198 	    WRITE WRITE-PRODUCT.  
000199 	     
000200 WRITE-CORRECT-PRODUCT.
000201 	   MOVE " " TO WRITE-STRING	
000202     STRING PRODUCT-ID DELIMITED BY SIZE
000203  		   ' '   DELIMITED BY SIZE
000204			   PRODUCT-NAME DELIMITED BY SIZE
000205			   ' '   DELIMITED BY SIZE
000206			   PRODUCT-PRICE DELIMITED BY SIZE
000207			   ' '   DELIMITED BY SIZE
000208			   PRODUCT-AMOUNT DELIMITED BY SIZE
000209			   ' '   DELIMITED BY SIZE
000210			   COST-PRODUCT DELIMITED BY SIZE
000211			   INTO WRITE-STRING
000212	    END-STRING	    
000213 	    WRITE WRITE-PRODUCT.
000214 WRITE-TOTALCOST-PRODUCT.
000215 	   MOVE " " TO WRITE-STRING	
000216     STRING DISPLAY-TOTALCOST DELIMITED BY SIZE
000217  		  COST-ALL DELIMITED BY SIZE
000225			  INTO WRITE-STRING
000226	    END-STRING	    
000227 	    WRITE WRITE-PRODUCT. 
000228 WRITE-TOTAL-PRODUCT.
000229 	   MOVE " " TO WRITE-STRING	
000230     STRING DISPLAY-TOTALPRODUCT DELIMITED BY SIZE
000231  		  COUNT-ALL DELIMITED BY SIZE
000232			  INTO WRITE-STRING
000233	    END-STRING	    
000234 	    WRITE WRITE-PRODUCT.   
000235 	    
000236 WRITE-TOTALERROR-PRODUCT.
000237 	   MOVE " " TO WRITE-STRING	
000238     STRING DISPLAY-TOTALPRODUCT-ERROR DELIMITED BY SIZE
000239  		  COUNT-ERROR DELIMITED BY SIZE
000240			  INTO WRITE-STRING
000241	    END-STRING	    
000242 	    WRITE WRITE-PRODUCT.
000243 WRITE-TOTALNORMAL-PRODUCT.
000244 	   MOVE " " TO WRITE-STRING	
000245     STRING DISPLAY-TOTALPRODUCT-NORMAL DELIMITED BY SIZE
000246  		  COUNT-NORMAL DELIMITED BY SIZE
000247			  INTO WRITE-STRING
000248	    END-STRING	    
000249 	    WRITE WRITE-PRODUCT.	    
000250 	    
000251 	    	    
000252 DISPLAY-RESULT.
000253 	   OPEN EXTEND WRITEFILE.
000254 	   DISPLAY DISPLAY-TOTALCOST COST-ALL.
000255 	   PERFORM WRITE-TOTALCOST-PRODUCT.
000256 	   DISPLAY DISPLAY-TOTALPRODUCT COUNT-ALL .
000257 	   PERFORM WRITE-TOTAL-PRODUCT.
000258 	   DISPLAY DISPLAY-TOTALPRODUCT-ERROR COUNT-ERROR.
000259 	   PERFORM WRITE-TOTALERROR-PRODUCT.
000260 	   SUBTRACT COUNT-ERROR FROM COUNT-ALL GIVING COUNT-NORMAL.
000261 	   DISPLAY DISPLAY-TOTALPRODUCT-NORMAL COUNT-NORMAL.	
000262 	   PERFORM WRITE-TOTALNORMAL-PRODUCT.
000263 	   CLOSE WRITEFILE.
000270 END PROGRAM Example1.