000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   Example1.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000051 INPUT-OUTPUT SECTION.
000052 FILE-CONTROL.
000054 		SELECT PRODUCTFILE ASSIGN TO "PRODUCT1.txt"
000056           ORGANIZATION IS LINE SEQUENTIAL.
000057      SELECT WRITEFILE ASSIGN TO "RESULTS.txt"
000058           ORGANIZATION IS LINE SEQUENTIAL.
000059      SELECT PRODUCTFILE-I ASSIGN TO "PRODUCTI.txt"
000060      	 ORGANIZATION IS LINE SEQUENTIAL.
000061      SELECT WORKFILE ASSIGN TO "PRODUCTW.TMP".
000063                
000064 DATA DIVISION.
000065 FILE SECTION.
000067 FD PRODUCTFILE.
000068 01 PRODUCT.
000069 		88  END-OF-PRODUCTFILE  VALUE HIGH-VALUES.
000070		02  PRODUCT-ID       PIC X(4).
000071 		02  PRODUCT-NAME		  PIC X(20).
000072 		02  PRODUCT-PRICE      PIC 9(4).
000073 		02  PRODUCT-AMOUNT     PIC 9(3).
000074* process sort file.
000075 FD PRODUCTFILE-I.
000076 01 PRODUCT-I.
000077 		88  END-OF-PRODUCTFILE-I  VALUE HIGH-VALUES.
000078		02  PRODUCT-ID-I       PIC X(4).
000079 		02  PRODUCT-NAME-I		  PIC X(20).
000080 		02  PRODUCT-PRICE-I      PIC 9(4).
000081 		02  PRODUCT-AMOUNT-I     PIC 9(3).	
000082 	
000083 SD WORKFILE.
000084 01 PRODUCT-W.
000085 		88  END-OF-PRODUCTFILE-W  VALUE HIGH-VALUES.
000086		02  PRODUCT-ID-W       PIC X(4).
000087 		02  PRODUCT-NAME-W		  PIC X(20).
000088 		02  PRODUCT-PRICE-W      PIC 9(4).
000089 		02  PRODUCT-AMOUNT-W     PIC 9(3).		
000090 		
000091 FD WRITEFILE.		
000092 01 WRITE-PRODUCT.
000093 		02 	WRITE-STRING PIC X(71).	
000094 		
000095 WORKING-STORAGE SECTION.
000096 01 COST.
000097 		02 COST-PRODUCT PIC 9(9) VALUE 0.
000098 		02 COST-ALL PIC 9(10) VALUE 0.
000099 		02 COST-GROUP PIC 9(10) VALUE 0.
000100 01 COUNT-PRODUCT.
000101 		02 COUNT-ALL PIC 9(3) VALUE 0.
000102 		02 COUNT-ERROR PIC 9(3) VALUE 0.	
000103 		02 COUNT-NORMAL PIC 9(3).	
000104 01 CHECK-GROUP PIC X.
000105 01 SUM-PART PIC 9(10) VALUE 0.
000106 
000107 01 TEMP-STRING PIC X(40).
000108 01 DISPLAY-SCREEN.
000109 		02 DISPLAY-GROUP PIC X(37) VALUE "                          GROUP-COST:".
000110 		02 DISPLAY-ERROR PIC X(13) VALUE " >>>>>> ERROR".
000111 		02 DISPLAY-TOTALCOST PIC X(39) VALUE "                                Total: ".
000112 		02 DISPLAY-TOTALPRODUCT PIC X(14) VALUE "PRODUCT TOTAL:".
000113 		02 DISPLAY-TOTALPRODUCT-ERROR PIC X(15) VALUE "PRODUCT ERROR :".
000114 		02 DISPLAY-TOTALPRODUCT-NORMAL PIC X(15) VALUE "PRODUCT NORMAL:".
000115 PROCEDURE DIVISION.
000116 MAIN-PROGRAM.
000117 		PERFORM SORT-FILE
000118 		PERFORM MAIN-PROCESS
000119 		PERFORM DISPLAY-RESULT
000120		STOP RUN.
000121 
000122 
000123 MAIN-PROCESS.
000124     OPEN INPUT PRODUCTFILE.
000125     OPEN OUTPUT WRITEFILE.
000126     READ PRODUCTFILE
000127         AT END SET END-OF-PRODUCTFILE TO TRUE
000128     END-READ
000129    
000130     PERFORM UNTIL END-OF-PRODUCTFILE
000131     ADD 1 TO COUNT-ALL
000132*     PERFORM COUNT-GROUP-FUNCTION
000133	   IF COUNT-ALL = 1	 THEN
000134	       MOVE PRODUCT-ID(1:1) TO CHECK-GROUP	
000135	   END-IF 
000136	   
000137	   IF PRODUCT-PRICE IS NUMERIC AND PRODUCT-AMOUNT IS NUMERIC THEN
000138	       MULTIPLY PRODUCT-PRICE BY PRODUCT-AMOUNT GIVING COST-PRODUCT
000139	       
000140	       IF CHECK-GROUP = PRODUCT-ID(1:1) THEN
000141	           ADD COST-PRODUCT TO COST-GROUP
000142	       ELSE
000143	       	   DISPLAY DISPLAY-GROUP CHECK-GROUP SPACE COST-GROUP
000144	       	   
000145	       	   PERFORM WRITE-GROUP-PRODUCT
000146	       	   
000147	           MOVE PRODUCT-ID(1:1) TO CHECK-GROUP
000148	           MOVE COST-PRODUCT TO COST-GROUP
000149	       END-IF
000150	       
000151    	   DISPLAY PRODUCT-ID SPACE PRODUCT-NAME SPACE PRODUCT-PRICE 
000152    	   SPACE PRODUCT-AMOUNT SPACE COST-PRODUCT
000153    	   PERFORM WRITE-CORRECT-PRODUCT
000154    	   
000155    	   ADD COST-PRODUCT TO COST-ALL
000156	   ELSE
000157	   	   ADD 1 TO COUNT-ERROR
000158	   	   IF CHECK-GROUP NOT EQUAL PRODUCT-ID(1:1) THEN
000159	   	       DISPLAY DISPLAY-GROUP CHECK-GROUP SPACE  COST-GROUP
000160	   	       
000161	   	       PERFORM WRITE-GROUP-PRODUCT
000162	   	       
000163	   	       MOVE PRODUCT-ID(1:1) TO CHECK-GROUP
000164	   	       MOVE 0 TO COST-GROUP
000165	   	       
000166	   	   END-IF
000167	       DISPLAY PRODUCT-ID SPACE PRODUCT-NAME DISPLAY-ERROR
000168	       PERFORM WRITE-ERROR-PRODUCT
000169	   END-IF	
000170     
000171     READ PRODUCTFILE
000172             AT END SET END-OF-PRODUCTFILE TO TRUE
000173     END-READ
000174     
000175     END-PERFORM
000176     DISPLAY DISPLAY-GROUP CHECK-GROUP SPACE  COST-GROUP	
000177     PERFORM WRITE-GROUP-PRODUCT
000178     
000179     CLOSE WRITEFILE.
000180     CLOSE PRODUCTFILE.
000181     
000182 WRITE-GROUP-PRODUCT.
000183 		MOVE " " TO WRITE-STRING	
000184 		STRING DISPLAY-GROUP DELIMITED BY SIZE
000185					CHECK-GROUP DELIMITED BY SPACE
000186					' '   DELIMITED BY SIZE
000187					COST-GROUP DELIMITED BY SPACE
000188					INTO WRITE-STRING
000189			   END-STRING
000190 	    WRITE WRITE-PRODUCT. 
000191 WRITE-ERROR-PRODUCT.
000192		MOVE " " TO WRITE-STRING	
000193  	STRING PRODUCT-ID DELIMITED BY SIZE
000194  		   ' '   DELIMITED BY SIZE
000195			   PRODUCT-NAME DELIMITED BY SIZE
000196			   DISPLAY-ERROR DELIMITED BY SIZE
000197			   INTO WRITE-STRING
000198	    END-STRING	    
000199 	    WRITE WRITE-PRODUCT.  
000200 	     
000201 WRITE-CORRECT-PRODUCT.
000202 	   MOVE " " TO WRITE-STRING	
000203     STRING PRODUCT-ID DELIMITED BY SIZE
000204  		   ' '   DELIMITED BY SIZE
000205			   PRODUCT-NAME DELIMITED BY SIZE
000206			   ' '   DELIMITED BY SIZE
000207			   PRODUCT-PRICE DELIMITED BY SIZE
000208			   ' '   DELIMITED BY SIZE
000209			   PRODUCT-AMOUNT DELIMITED BY SIZE
000210			   ' '   DELIMITED BY SIZE
000211			   COST-PRODUCT DELIMITED BY SIZE
000212			   INTO WRITE-STRING
000213	    END-STRING	    
000214 	    WRITE WRITE-PRODUCT.
000215 WRITE-TOTALCOST-PRODUCT.
000216 	   MOVE " " TO WRITE-STRING	
000217     STRING DISPLAY-TOTALCOST DELIMITED BY SIZE
000218  		  COST-ALL DELIMITED BY SIZE
000225			  INTO WRITE-STRING
000226	    END-STRING	    
000227 	    WRITE WRITE-PRODUCT. 
000228 WRITE-TOTAL-PRODUCT.
000229 	   MOVE " " TO WRITE-STRING	
000230     STRING DISPLAY-TOTALPRODUCT DELIMITED BY SIZE
000231  		  COUNT-ALL DELIMITED BY SIZE
000232			  INTO WRITE-STRING
000233	    END-STRING	    
000234 	    WRITE WRITE-PRODUCT.   
000235 	    
000236 WRITE-TOTALERROR-PRODUCT.
000237 	   MOVE " " TO WRITE-STRING	
000238     STRING DISPLAY-TOTALPRODUCT-ERROR DELIMITED BY SIZE
000239  		  COUNT-ERROR DELIMITED BY SIZE
000240			  INTO WRITE-STRING
000241	    END-STRING	    
000242 	    WRITE WRITE-PRODUCT.
000243 WRITE-TOTALNORMAL-PRODUCT.
000244 	   MOVE " " TO WRITE-STRING	
000245     STRING DISPLAY-TOTALPRODUCT-NORMAL DELIMITED BY SIZE
000246  		  COUNT-NORMAL DELIMITED BY SIZE
000247			  INTO WRITE-STRING
000248	    END-STRING	    
000249 	    WRITE WRITE-PRODUCT.	    
000250 	    
000251 	    	    
000252 DISPLAY-RESULT.
000253 	   OPEN EXTEND WRITEFILE.
000254 	   DISPLAY DISPLAY-TOTALCOST COST-ALL.
000255 	   PERFORM WRITE-TOTALCOST-PRODUCT.
000256 	   DISPLAY DISPLAY-TOTALPRODUCT COUNT-ALL .
000257 	   PERFORM WRITE-TOTAL-PRODUCT.
000258 	   DISPLAY DISPLAY-TOTALPRODUCT-ERROR COUNT-ERROR.
000259 	   PERFORM WRITE-TOTALERROR-PRODUCT.
000260 	   SUBTRACT COUNT-ERROR FROM COUNT-ALL GIVING COUNT-NORMAL.
000261 	   DISPLAY DISPLAY-TOTALPRODUCT-NORMAL COUNT-NORMAL.	
000262 	   PERFORM WRITE-TOTALNORMAL-PRODUCT.
000263 	   CLOSE WRITEFILE.
000265 SORT-FILE.
000266 		SORT WORKFILE ON ASCENDING KEY PRODUCT-ID-W
000267   	USING PRODUCTFILE-I GIVING PRODUCTFILE.
000269 	   
000270 END PROGRAM Example1.