000010*>
000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   Example1.
000040 ENVIRONMENT    DIVISION.
000050 CONFIGURATION  SECTION.
000051 INPUT-OUTPUT SECTION.
000052 FILE-CONTROL.
000054 		SELECT PRODUCTFILE ASSIGN TO "PRODUCTO.txt"
000056           ORGANIZATION IS LINE SEQUENTIAL.
000057      SELECT WRITEFILE ASSIGN TO "RESULTS.txt"
000058           ORGANIZATION IS LINE SEQUENTIAL.
000059      SELECT PRODUCTFILE-I ASSIGN TO "PRODUCTI.txt"
000060      	 ORGANIZATION IS LINE SEQUENTIAL.
000061      SELECT WORKFILE ASSIGN TO "PRODUCTW.TMP".
000063                
000064 DATA DIVISION.
000065 FILE SECTION.
000067 FD PRODUCTFILE.
000068 01 PRODUCT.
000069 		88  END-OF-PRODUCTFILE  VALUE HIGH-VALUES.
000070		02  PRODUCT-ID       PIC X(4).
000071 		02  PRODUCT-NAME		  PIC X(20).
000072 		02  PRODUCT-PRICE      PIC 9(4).
000073 		02  PRODUCT-AMOUNT     PIC 9(3).
000074
000075 FD PRODUCTFILE-I.
000076 01 PRODUCT-I.
000078		02  PRODUCT-ID-I       PIC X(4).
000079 		02  PRODUCT-NAME-I		  PIC X(20).
000080 		02  PRODUCT-PRICE-I      PIC 9(4).
000081 		02  PRODUCT-AMOUNT-I     PIC 9(3).	
000082 	
000083 SD WORKFILE.
000084 01 PRODUCT-W.
000086		02  PRODUCT-ID-W       PIC X(4).
000087 		02  PRODUCT-NAME-W		  PIC X(20).
000088 		02  PRODUCT-PRICE-W      PIC 9(4).
000089 		02  PRODUCT-AMOUNT-W     PIC 9(3).		
000090 		
000091 FD WRITEFILE.		
000092 01 WRITE-PRODUCT.
000093 		02 	WRITE-STRING PIC X(71).	
000094 		
000095 WORKING-STORAGE SECTION.
000096 01 COST.
000097 		02 COST-PRODUCT PIC 9(9) VALUE ZERO.
000098 		02 COST-ALL PIC 9(10) VALUE ZERO.
000099 		02 COST-GROUP PIC 9(10) VALUE ZERO.
000100 01 COUNT-PRODUCT.
000101 		02 COUNT-ALL PIC 9(3) VALUE ZERO.
000102 		02 COUNT-ERROR PIC 9(3) VALUE ZERO.	
000103 		02 COUNT-NORMAL PIC 9(3).
000104 					
000107 01 SUM-PART PIC 9(10) VALUE ZERO.
000108 
000109 01 TEMP-STRING PIC X(40).
000110 01 INIT-CONSTANT-VALUE.
000111 		02 DISPLAY-GROUP               PIC X(37) VALUE "                          GROUP-COST:".
000112 		02 DISPLAY-ERROR               PIC X(13) VALUE " >>>>>> ERROR".
000113 		02 DISPLAY-TOTALCOST 		   PIC X(39) VALUE "                                Total: ".
000114 		02 DISPLAY-TOTALPRODUCT        PIC X(14) VALUE "PRODUCT TOTAL:".
000115 		02 DISPLAY-TOTALPRODUCT-ERROR  PIC X(15) VALUE "PRODUCT ERROR :".
000116 		02 DISPLAY-TOTALPRODUCT-NORMAL PIC X(15) VALUE "PRODUCT NORMAL:".
000117 		02 INIT-DISPLAY-PRODUCT-ID          PIC X(4) VALUE "ID".
000118 		02 INIT-DISPLAY-PRODUCT-NAME        PIC X(20) VALUE "NAME".
000119 		02 INIT-PRODUCT-PRICE          PIC X(5) VALUE "PRICE".
000120 		02 INIT-PRODUCT-AMOUNT         PIC X(6) VALUE "AMOUNT".
000121 		02 INIT-PRODUCT-COST           PIC X(12) VALUE " COST".
000122 		02 INIT-TITLE                  PIC X(100).
000123 		
000124 01 DISPLAY-VALUE.
000125 	    02 DISPLAY-COST-PRODUCT   PIC z,zzz,zz9 	BLANK WHEN ZERO. 
000126 	    02 DISPLAY-COST-GROUP     PIC zz,zzz,zz9	BLANK WHEN ZERO.
000127 	    02 DISPLAY-COST-ALL       PIC zzz,zzz,zz9 BLANK WHEN ZERO.
000128 	    02 DISPLAY-PRODUCT-PRICE  PIC z,zz9 	BLANK WHEN ZERO.
000129 	    02 DISPLAY-PRODUCT-AMOUNT PIC z,zz9 	BLANK WHEN ZERO.
000131 01 CHECK.
000132 		02 CHECK-GROUP            PIC X.
000133 PROCEDURE DIVISION.
000134 MAIN-PROGRAM.
000135 		PERFORM SORT-FILE
000136 		PERFORM INIT-PROGRAM
000137 		PERFORM MAIN-PROCESS
000138 		PERFORM DISPLAY-WRITE-RESULT
000139		STOP RUN.
000140 INIT-PROGRAM.
000141 		STRING INIT-DISPLAY-PRODUCT-ID DELIMITED BY SIZE
000142  		   '  '   DELIMITED BY SIZE
000143			   INIT-DISPLAY-PRODUCT-NAME DELIMITED BY SIZE
000144			   '  '   DELIMITED BY SIZE
000145			   INIT-PRODUCT-PRICE DELIMITED BY SIZE
000146			   '  '   DELIMITED BY SIZE
000147			   INIT-PRODUCT-AMOUNT DELIMITED BY SIZE
000148			   '  '   DELIMITED BY SIZE
000149			   INIT-PRODUCT-COST DELIMITED BY SIZE
000150			   INTO INIT-TITLE
000151	    END-STRING	
000152	    DISPLAY INIT-TITLE.
000153 
000154 MAIN-PROCESS.
000155     OPEN INPUT PRODUCTFILE.
000156     OPEN OUTPUT WRITEFILE.
000157     READ PRODUCTFILE
000158         AT END SET END-OF-PRODUCTFILE TO TRUE
000159     END-READ
000160    
000161     PERFORM UNTIL END-OF-PRODUCTFILE
000162     ADD 1 TO COUNT-ALL
000163*     PERFORM COUNT-GROUP-FUNCTION
000164	   IF COUNT-ALL = 1	 THEN
000165	       MOVE PRODUCT-ID(1:1) TO CHECK-GROUP	
000166	   END-IF 
000167	   
000168	   IF PRODUCT-PRICE IS NUMERIC AND PRODUCT-AMOUNT IS NUMERIC THEN
000169	       MULTIPLY PRODUCT-PRICE BY PRODUCT-AMOUNT GIVING COST-PRODUCT
000170	       
000171	       IF CHECK-GROUP = PRODUCT-ID(1:1) THEN
000172	           ADD COST-PRODUCT TO COST-GROUP
000173	       ELSE	
000175	       	   PERFORM DISPLAY-GROUP-PRODUCT
000176	       	   
000177	           MOVE PRODUCT-ID(1:1) TO CHECK-GROUP
000178	           MOVE COST-PRODUCT TO COST-GROUP
000179	       END-IF
000180	       MOVE COST-PRODUCT TO DISPLAY-COST-PRODUCT
000183    	   PERFORM DISPLAY-CORRECT-PRODUCT
000184    	   
000185    	   ADD COST-PRODUCT TO COST-ALL
000186	   ELSE
000187	   	   ADD 1 TO COUNT-ERROR
000188	   	   IF CHECK-GROUP NOT EQUAL PRODUCT-ID(1:1) THEN
000189*	   	       DISPLAY DISPLAY-GROUP CHECK-GROUP SPACE  COST-GROUP
000190	   	       
000191	   	       PERFORM DISPLAY-GROUP-PRODUCT
000192	   	       
000193	   	       MOVE PRODUCT-ID(1:1) TO CHECK-GROUP
000194	   	       MOVE 0 TO COST-GROUP
000195	   	       
000196	   	   END-IF
000197*	       DISPLAY PRODUCT-ID SPACE PRODUCT-NAME DISPLAY-ERROR
000198	       PERFORM DISPLAY-ERROR-PRODUCT
000199	   END-IF	
000200     
000201     READ PRODUCTFILE
000202             AT END SET END-OF-PRODUCTFILE TO TRUE
000203     END-READ
000204     
000205     END-PERFORM
000206*     DISPLAY DISPLAY-GROUP CHECK-GROUP SPACE  COST-GROUP	
000207     PERFORM DISPLAY-GROUP-PRODUCT
000208     
000209     CLOSE WRITEFILE.
000210     CLOSE PRODUCTFILE.
000211     
000212 DISPLAY-GROUP-PRODUCT.
000213 		MOVE " " TO WRITE-STRING	
000214 		MOVE COST-GROUP TO DISPLAY-COST-GROUP
000215 		STRING DISPLAY-GROUP DELIMITED BY SIZE
000216					CHECK-GROUP DELIMITED BY SPACE
000217					' '   DELIMITED BY SIZE
000218					DISPLAY-COST-GROUP DELIMITED BY SIZE
000219					INTO WRITE-STRING
000220			   END-STRING
000221 	    DISPLAY WRITE-PRODUCT. 
000222 DISPLAY-ERROR-PRODUCT.
000223		MOVE " " TO WRITE-STRING	
000224  	STRING PRODUCT-ID DELIMITED BY SIZE
000225  		   '  '   DELIMITED BY SIZE
000226			   PRODUCT-NAME DELIMITED BY SIZE
000227			   DISPLAY-ERROR DELIMITED BY SIZE
000228			   INTO WRITE-STRING
000229	    END-STRING
000230	    DISPLAY WRITE-STRING.	    
000231* 	    WRITE WRITE-PRODUCT.  
000232 	     
000233 DISPLAY-CORRECT-PRODUCT.
000234 	   MOVE " " TO WRITE-STRING	
000235 	   MOVE PRODUCT-AMOUNT TO DISPLAY-PRODUCT-AMOUNT
000236 	   MOVE PRODUCT-PRICE TO DISPLAY-PRODUCT-PRICE
000237 	   MOVE COST-PRODUCT TO DISPLAY-COST-PRODUCT
000238     STRING PRODUCT-ID DELIMITED BY SIZE
000239  		   '  '   DELIMITED BY SIZE
000240			   PRODUCT-NAME DELIMITED BY SIZE
000241			   '  '   DELIMITED BY SIZE
000242			   DISPLAY-PRODUCT-PRICE DELIMITED BY SIZE
000243			   '  '   DELIMITED BY SIZE
000244			   DISPLAY-PRODUCT-AMOUNT DELIMITED BY SIZE
000245			   '  '   DELIMITED BY SIZE
000246			   DISPLAY-COST-PRODUCT DELIMITED BY SIZE
000247			   INTO WRITE-STRING
000248	    END-STRING	
000249	    DISPLAY WRITE-STRING.    
000250* 	    WRITE WRITE-PRODUCT.
000251 DISPLAY-TOTALCOST-PRODUCT.
000252 	   MOVE " " TO WRITE-STRING	
000253 	   MOVE COST-ALL TO DISPLAY-COST-ALL
000254     STRING DISPLAY-TOTALCOST DELIMITED BY SIZE
000255  		  DISPLAY-COST-ALL DELIMITED BY SIZE
000256			  INTO WRITE-STRING
000257	    END-STRING	    
000258 	    DISPLAY WRITE-PRODUCT. 
000259 DISPLAY-TOTAL-PRODUCT.
000260 	   MOVE " " TO WRITE-STRING	
000262     STRING DISPLAY-TOTALPRODUCT DELIMITED BY SIZE
000263  		  COUNT-ALL DELIMITED BY SIZE
000264			  INTO WRITE-STRING
000265	    END-STRING	    
000266 	    DISPLAY WRITE-PRODUCT.   
000267 	    
000268 DISPLAY-TOTALERROR-PRODUCT.
000269 	   MOVE " " TO WRITE-STRING	
000270     STRING DISPLAY-TOTALPRODUCT-ERROR DELIMITED BY SIZE
000271  		  COUNT-ERROR DELIMITED BY SIZE
000272			  INTO WRITE-STRING
000273	    END-STRING	    
000274 	    DISPLAY WRITE-PRODUCT.
000275 DISPLAY-TOTALNORMAL-PRODUCT.
000276 	   MOVE " " TO WRITE-STRING	
000277 	   SUBTRACT COUNT-ERROR FROM COUNT-ALL GIVING COUNT-NORMAL.
000278     STRING DISPLAY-TOTALPRODUCT-NORMAL DELIMITED BY SIZE
000279  		  COUNT-NORMAL DELIMITED BY SIZE
000280			  INTO WRITE-STRING
000281	    END-STRING	    
000282 	    DISPLAY WRITE-PRODUCT.	    
000283 	    
000284 	    	    
000285 DISPLAY-WRITE-RESULT.
000286 	   OPEN EXTEND WRITEFILE.
000287 	   PERFORM DISPLAY-TOTALCOST-PRODUCT.
000288 	   PERFORM DISPLAY-TOTAL-PRODUCT.
000289 	   PERFORM DISPLAY-TOTALERROR-PRODUCT.
000292 	   PERFORM DISPLAY-TOTALNORMAL-PRODUCT.
000293 	   CLOSE WRITEFILE.
000294 SORT-FILE.
000295 		SORT WORKFILE ON ASCENDING KEY PRODUCT-ID-W
000296   	USING PRODUCTFILE-I GIVING PRODUCTFILE.
000297 	   
000298 END PROGRAM Example1.