000100*========================================================================
000200*   従業員管理プログラム　　　　　　　－オブジェクト指向機能サンプル－
000300*
000400*　〇機能
000500*　　１）従業員情報の登録
000600*　　２）従業員情報の削除
000700*  　３）従業員情報の修正
000800*  　４）給与計算及び各従業員毎の給与情報の参照
000900*  　５）職級毎の従業員住所録印刷
001000*
001100*　〇参照クラス
001200*　　１）従業員管理クラス (Control-member-class)
001300*
001400*　〇環境変数
001500*　　　ＰＦ２及びＰＦ３キーを有効とするために，環境変数情報として以下を
001600*　　指定してください。
001700*
001800*  　　  TERMINATOR=!PF1,PF2-PF3,!PF4-PF12
001900*
002000*                              Copyright 1997-2015 FUJITSU LIMITED
002100*========================================================================
002200 PROGRAM-ID.    Main.
002300 ENVIRONMENT    DIVISION.
002400 CONFIGURATION  SECTION.
002500   REPOSITORY.
002600     CLASS  Control-member-class.
002700*
002800   SPECIAL-NAMES.
002900     CRT  STATUS  IS  画面入力状態.
003000*
003100 DATA                 DIVISION.
003200 WORKING-STORAGE      SECTION.
003300*
003400   01  画面－選択番号                PIC X(01).
003500   01  画面－職級選択                PIC 9(01).
003600   01  画面データ.
003700     02  画面－従業員番号            PIC 9(04).
003800     02  画面－氏名                  PIC N(08).
003900     02  画面－郵便番号.
004000        03  画面－郵便番号１         PIC X(03).
004100        03  画面－郵便番号２         PIC X(04).
004200     02  画面－住所                  PIC N(20).
004300     02  画面－入社年月日            PIC X(08).
004400     02  画面－退社年月日            PIC X(08).
004500     02  画面－職級                  PIC 9(01).
004600     02  画面－基本給                PIC 9(08).
004700     02  画面－特別手当              PIC 9(06).
004800     02  画面－メッセージ            PIC X(65).
004900     02  画面－時間外手当            PIC 9(05).
005000     02  画面－残業時間              PIC 999.9.
005100     02  画面－総支給                PIC 9(08).
005200     02  画面－確認                  PIC X(01).
005300*
005400   01  画面入力状態.
005500     02  状態キー.
005600        03  状態キー１               PIC X(01).
005700        03  状態キー２               PIC X(01).
005800     02                              PIC X(01).
005900   01  終了キー.
006000        03                           PIC X(01)  VALUE       "1".
006100        03                           PIC X(01)  VALUE       X"02".
006200   01  確定キー.
006300        03                           PIC X(01)  VALUE       "1".
006400        03                           PIC X(01)  VALUE       X"03".
006500*
006600   01  復帰値                        PIC 9(04)  COMP.
006700*
006800   01  従業員管理－オブジェクト  USAGE  OBJECT REFERENCE
006900                                                   Control-member-class.
007000*
007100 CONSTANT SECTION.
007200   01 職級エラー  PIC X(65) VALUE
007300     "「職級」には１（管理者）または２（一般社員）を設定してください。".
007400*
007500   SCREEN                SECTION.
007600   01  従業員管理画面    BLANK    SCREEN.
007700     03  VALUE    NC"－－＜従業員管理＞－－" LINE  02  COLUMN 29.
007800     03  VALUE    NC"１．従業員情報登録"     LINE  04  COLUMN 31.
007900     03  VALUE    NC"２．従業員情報削除"     LINE  06  COLUMN 31.
008000     03  VALUE    NC"３．従業員情報修正"     LINE  08  COLUMN 31.
008100     03  VALUE    NC"４．給与計算"           LINE  10  COLUMN 31.
008200     03  VALUE    NC"５．住所録"             LINE  12  COLUMN 31.
008300     03  VALUE    NC"Ｘ．終了"               LINE  14  COLUMN 31.
008400     03  VALUE    NC"選択番号＝＝＞"         LINE  16  COLUMN 31.
008500     03  コード   PIC X(01)                  LINE  16  COLUMN 46
008600         USING    画面－選択番号             UNDERLINE.
008700*
008800   01  従業員登録画面    BLANK    SCREEN.
008900     03  VALUE    NC"－－＜従業員登録＞－－" LINE  02  COLUMN 29.
009000     03  VALUE    NC"従業員番号"             LINE  04  COLUMN 11.
009100     03  番号１   PIC 9(04)                  LINE  04  COLUMN 25
009200         USING    画面－従業員番号           UNDERLINE.
009300     03  VALUE    NC"氏名"                   LINE  06  COLUMN 11.
009400     03  Ｗ－氏名１   PIC N(08)              LINE  06  COLUMN 25
009500         USING    画面－氏名                 UNDERLINE.
009600     03  VALUE    NC"住所"                   LINE  08  COLUMN 11.
009700     03  郵便１１ PIC X(03)                  LINE  08  COLUMN 25
009800         USING    画面－郵便番号１           UNDERLINE.
009900     03  VALUE    "-"            LINE  08  COLUMN  28  UNDERLINE.
010000     03  郵便１２ PIC X(04)                  LINE  08  COLUMN 29
010100         USING    画面－郵便番号２           UNDERLINE.
010200     03  住所１   PIC N(20)                  LINE  08  COLUMN 35
010300         USING    画面－住所                 UNDERLINE.
010400     03  VALUE    NC"入社年月日"             LINE  10  COLUMN 11.
010500     03  入社１   PIC X(08)                  LINE  10  COLUMN 25
010600         USING    画面－入社年月日           UNDERLINE.
010700     03  VALUE    NC"職級"                   LINE  12  COLUMN 11.
010800     03  職級１   PIC 9(01)                  LINE  12  COLUMN 25
010900         USING    画面－職級                 UNDERLINE.
011000     03  VALUE    NC"基本給"                 LINE  14  COLUMN 11.
011100     03  基本１   PIC 9(08)                  LINE  14  COLUMN 25
011200         USING    画面－基本給               UNDERLINE.
011300     03  VALUE    NC"特別手当"               LINE  16  COLUMN 11.
011400     03  特別１   PIC 9(06)                  LINE  16  COLUMN 27
011500         USING    画面－特別手当             UNDERLINE.
011600     03  VALUE    NC"時間外手当"             LINE  18  COLUMN 11.
011700     03  時間外１ PIC 9(05)                  LINE  18  COLUMN 28
011800         USING    画面－時間外手当           UNDERLINE.
011900     03  メッセージ１ PIC X(65)              LINE  20  COLUMN 11
012000         USING    画面－メッセージ           UNDERLINE.
012100     03  VALUE    NC"Ｆ２：終了　Ｆ３：登録" LINE  22  COLUMN 43.
012200*
012300   01  従業員選択画面    BLANK    SCREEN.
012400     03  VALUE    NC"－－＜従業員選択＞－－" LINE  02  COLUMN 29.
012500     03  VALUE    NC"従業員番号"             LINE  04  COLUMN 11.
012600     03  番号２   PIC 9(04)                  LINE  04  COLUMN 25
012700         USING    画面－従業員番号           UNDERLINE.
012800     03  メッセージ２ PIC X(65)              LINE  20  COLUMN 11
012900         USING    画面－メッセージ           UNDERLINE.
013000     03  VALUE    NC"Ｆ２：終了　Ｆ３：選択" LINE  22  COLUMN 43.
013100*
013200   01  従業員修正画面    BLANK    SCREEN.
013300     03  VALUE    NC"－－＜従業員修正＞－－" LINE  02  COLUMN 29.
013400     03  VALUE    NC"氏名"                   LINE  04  COLUMN 11.
013500     03  氏名３   PIC N(08)                  LINE  04  COLUMN 25
013600         USING    画面－氏名                 UNDERLINE.
013700     03  VALUE    NC"住所"                   LINE  06  COLUMN 11.
013800     03  郵便３１ PIC X(03)                  LINE  06  COLUMN 25
013900         USING    画面－郵便番号１           UNDERLINE.
014000     03  VALUE    "-"            LINE  06  COLUMN  28  UNDERLINE.
014100     03  郵便３２ PIC X(04)                  LINE  06  COLUMN 29
014200         USING    画面－郵便番号２           UNDERLINE.
014300     03  住所３   PIC N(20)                  LINE  06  COLUMN 35
014400         USING    画面－住所                 UNDERLINE.
014500     03  VALUE    NC"入社年月日"             LINE  08  COLUMN 11.
014600     03  入社３   PIC X(08)                  LINE  08  COLUMN 25
014700         USING    画面－入社年月日           UNDERLINE.
014800     03  VALUE    NC"退社年月日"             LINE  10  COLUMN 11.
014900     03  退社３   PIC X(08)                  LINE  10  COLUMN 25
015000         USING    画面－退社年月日           UNDERLINE.
015100     03  VALUE    NC"職級"                   LINE  12  COLUMN 11.
015200     03  職級３   PIC 9(01)                  LINE  12  COLUMN 25
015300         USING    画面－職級                 UNDERLINE.
015400     03  VALUE    NC"基本給"                 LINE  14  COLUMN 11.
015500     03  基本３   PIC 9(08)                  LINE  14  COLUMN 25
015600         USING    画面－基本給               UNDERLINE.
015700     03  VALUE    NC"特別手当"               LINE  16  COLUMN 11.
015800     03  特別３   PIC 9(06)                  LINE  16  COLUMN 27
015900         USING    画面－特別手当             UNDERLINE.
016000     03  VALUE    NC"時間外手当"             LINE  18  COLUMN 11.
016100     03  時間外３ PIC 9(05)                  LINE  18  COLUMN 28
016200         USING    画面－時間外手当           UNDERLINE.
016300     03  VALUE    NC"残業時間"               LINE  20  COLUMN 11.
016400     03  残業時間３   PIC 999.9              LINE  20  COLUMN 28
016500         USING    画面－残業時間             UNDERLINE.
016600     03  メッセージ１ PIC X(65)              LINE  22  COLUMN 11
016700         USING    画面－メッセージ           UNDERLINE.
016800     03  VALUE    NC"Ｆ２：取消　Ｆ３：修正" LINE  24  COLUMN 43.
016900*
017000   01  職級選択画面    BLANK    SCREEN.
017100     03  VALUE    NC"－－＜住所録印刷＞－－" LINE  02  COLUMN 29.
017200     03  VALUE    NC"１．管理者"             LINE  04  COLUMN 31.
017300     03  VALUE    NC"２．一般社員"           LINE  06  COLUMN 31.
017400     03  VALUE    NC"選択番号＝＝＞"         LINE  14  COLUMN 31.
017500     03  コード   PIC X(01)                  LINE  14  COLUMN 46
017600         USING    画面－職級選択             UNDERLINE.
017700*
017800     03  VALUE    NC"Ｆ２：終了　Ｆ３：印刷" LINE  22  COLUMN 43.
017900*
018000   01  給与情報参照選択画面    BLANK    SCREEN.
018100     03  VALUE    NC"－－＜給与計算結果の参照＞－－" LINE  02  COLUMN 5.
018200     03  VALUE  NC"給与計算処理が完了しました。"     LINE  04  COLUMN 7.
018300     03  VALUE  NC"各従業員の給与情報を参照したい場合は，以下に従業員番"
018400                                             LINE  06  COLUMN 7.
018500     03  VALUE  NC"号を入力して下さい。"
018600                                             LINE  06  COLUMN 59.
018700     03  VALUE    NC"従業員番号"             LINE  08  COLUMN 7.
018800     03  番号２   PIC 9(04)                  LINE  08  COLUMN 21
018900         USING    画面－従業員番号           UNDERLINE.
019000     03  VALUE    NC"Ｆ２：終了　Ｆ３：選択" LINE  22  COLUMN 43.
019100*
019200   01  給与情報参照画面    BLANK    SCREEN.
019300     03  VALUE    NC"－－＜給与計算結果＞－－" LINE  02  COLUMN 29.
019400     03  VALUE    NC"従業員番号"             LINE  04  COLUMN 11.
019500     03  番号４   PIC 9(04)                  LINE  04  COLUMN 25
019600         USING    画面－従業員番号           UNDERLINE.
019700     03  VALUE    NC"氏名"                   LINE  06  COLUMN 11.
019800     03  Ｗ－氏名４   PIC N(08)              LINE  06  COLUMN 25
019900         USING    画面－氏名                 UNDERLINE.
020000     03  VALUE    NC"職級"                   LINE  08  COLUMN 11.
020100     03  職級４   PIC 9(01)                  LINE  08  COLUMN 25
020200         USING    画面－職級                 UNDERLINE.
020300     03  VALUE    NC"基本給"                 LINE  10  COLUMN 11.
020400     03  基本４   PIC 9(08)                  LINE  10  COLUMN 25
020500         USING    画面－基本給               UNDERLINE.
020600     03  VALUE    NC"特別手当"               LINE  12  COLUMN 11.
020700     03  特別４   PIC 9(06)                  LINE  12  COLUMN 27
020800         USING    画面－特別手当             UNDERLINE.
020900     03  VALUE    NC"時間外手当"             LINE  14  COLUMN 11.
021000     03  時間外４ PIC 9(05)                  LINE  14  COLUMN 28
021100         USING    画面－時間外手当           UNDERLINE.
021200     03  VALUE    NC"×"                     LINE  14  COLUMN 36.
021300     03  VALUE    NC"残業時間"               LINE  14  COLUMN 40.
021400     03  残業時間４ PIC 999.9                LINE  14  COLUMN 49
021500         USING    画面－残業時間             UNDERLINE.
021600     03  VALUE    NC"総支給"                 LINE  16  COLUMN 11.
021700     03  総支給４ PIC 9(08)                  LINE  16  COLUMN 25
021800         USING    画面－総支給               UNDERLINE.
021900     03  VALUE    NC"Ｆ２：終了"             LINE  22  COLUMN 50.
022000*
022100   01  削除確認画面    BLANK    SCREEN.
022200     03  VALUE    NC"－－＜従業員選択＞－－" LINE  02  COLUMN 29.
022300     03  VALUE    NC"従業員番号"             LINE  04  COLUMN 11.
022400     03  番号２   PIC 9(04)                  LINE  04  COLUMN 25
022500         USING    画面－従業員番号           UNDERLINE.
022600     03  VALUE    "削除してよろしいですか？（Y/N）"
022700                                             LINE  06  COLUMN 11.
022800     03  確認     PIC X(1)                   LINE  06  COLUMN 45
022900         USING    画面－確認                 UNDERLINE.
023000*
023100*========================================================================
023200*  メイン処理
023300*========================================================================
023400 PROCEDURE                  DIVISION.
023500*
023600     PERFORM    初期処理.
023700     PERFORM    主処理  UNTIL  画面－選択番号  =  "x"  OR "X".
023800     PERFORM    終了処理.
023900     EXIT PROGRAM.
024000*
024100*========================================================================
024200*  初期処理
024300*========================================================================
024400 初期処理  SECTION.
024500*
024600     INVOKE  Control-member-class "NEW"
024700       RETURNING  従業員管理－オブジェクト.
024800*
024900 初期処理出口.
025000     EXIT.
025100*
025200*========================================================================
025300*  主処理
025400*========================================================================
025500 主処理    SECTION.
025600*
025700     PERFORM     従業員管理画面処理.
025800*
025900 主処理出口.
026000     EXIT.
026100*
026200*========================================================================
026300*  終了処理
026400*========================================================================
026500 終了処理  SECTION.
026600*
026700 終了処理出口.
026800     EXIT.
026900*
027000*========================================================================
027100*  従業員管理画面処理
027200*
027300*（１）従業員管理画面（初期画面）を表示し，処理の選択を要求する。
027400*========================================================================
027500 従業員管理画面処理  SECTION.
027600*
027700     INITIALIZE 状態キー.
027800     MOVE      SPACE    TO    画面－選択番号.
027900     DISPLAY   従業員管理画面.
028000     ACCEPT    従業員管理画面.
028100     EVALUATE  画面－選択番号
028200     WHEN  "1"
028300         PERFORM  従業員登録画面処理  UNTIL  状態キー  =  終了キー
028400     WHEN  "2"
028500         PERFORM  従業員情報削除処理  UNTIL  状態キー  =  終了キー
028600     WHEN  "3"
028700         PERFORM  従業員情報修正処理  UNTIL  状態キー  =  終了キー
028800     WHEN  "4"
028900         INVOKE  従業員管理－オブジェクト  "Cal-salary"
029000         PERFORM  給与情報参照処理   UNTIL  状態キー  =  終了キー
029100     WHEN  "5"
029200         PERFORM  住所録印刷処理
029300     END-EVALUATE.
029400*
029500 従業員管理画面処理出口.
029600     EXIT.
029700*
029800*========================================================================
029900*  従業員登録画面処理
030000*
030100*（１）新規登録者の情報入力を要求し，入力された情報をオブジェクトに設定
030200*　　する。
030300*　・　ＰＦ３キーにより入力が確定し，ＰＦ４キーにより処理を終了する。
030400*　・　入力された職級が１又は２でなければ，再度入力を要求する。
030500*
030600*【注意】
030700*　　新規登録者の従業員番号として，既存の番号を指定した場合，既存の従業
030800*　員情報は，新規登録情報と置き変わってしまいます。
030900*========================================================================
031000 従業員登録画面処理         SECTION.
031100*
031200     INITIALIZE 画面データ.
031300*
031400 従業員情報入力.
031500     DISPLAY  従業員登録画面.
031600     MOVE  SPACE  TO  画面－メッセージ
031700     ACCEPT    従業員登録画面.
031800*
031900     EVALUATE  状態キー
032000     WHEN      終了キー
032100         GO  TO  従業員登録画面処理出口
032200     WHEN      確定キー
032300         INVOKE   従業員管理－オブジェクト  "Regist-member"
032400            USING    画面－従業員番号
032500                     画面－氏名
032600                     画面－郵便番号
032700                     画面－住所
032800                     画面－入社年月日
032900                     画面－退社年月日
033000                     画面－職級
033100                     画面－基本給
033200                     画面－特別手当
033300                     画面－時間外手当
033400                     画面－残業時間
033500            RETURNING  復帰値
033600
033700         IF  復帰値 NOT = 0  THEN
033800           MOVE  職級エラー  TO  画面－メッセージ
033900           GO TO  従業員情報入力
034000         END-IF
034100     END-EVALUATE.
034200*
034300 従業員登録画面処理出口.
034400     EXIT.
034500*
034600*========================================================================
034700*  従業員情報削除処理
034800*
034900*（１）従業員番号を指定し，その従業員番号の従業員情報を削除する。
035000*　・　ＰＦ３キーにより確定し，ＰＦ４キーにより処理を終了する。
035100*
035200*========================================================================
035300 従業員情報削除処理         SECTION.
035400*
035500     INITIALIZE 画面データ.
035600*
035700 従業員情報削除.
035800     INITIALIZE 状態キー.
035900     DISPLAY    従業員選択画面.
036000     ACCEPT     従業員選択画面.
036100*
036200     EVALUATE   状態キー
036300     WHEN       終了キー
036400         GO TO  従業員情報削除処理出口
036500     WHEN       確定キー
036600         MOVE  SPACE  TO  画面－確認
036700         DISPLAY   削除確認画面
036800         ACCEPT     確認
036900         IF  画面－確認  =  "Y"  OR
037000             画面－確認  =  "y"
037100         THEN
037200             INVOKE  従業員管理－オブジェクト  "Remove-member"
037300                                  USING     BY CONTENT 画面－従業員番号
037400                                  RETURNING 復帰値
037500         ELSE
037600             INITIALIZE  状態キー
037700             MOVE  SPACE  TO  画面－メッセージ
037800             GO  TO  従業員情報削除
037900         END-IF
038000*
038100         IF  復帰値  =  0
038200         THEN
038300             MOVE  "削除完了しました。"         TO  画面－メッセージ
038400         ELSE
038500             MOVE  "削除できませんでした。従業員番号を確認して下さい。"
038600                                                TO  画面－メッセージ
038700         END-IF
038800         GO  TO  従業員情報削除
038900     END-EVALUATE.
039000*
039100 従業員情報削除処理出口.
039200     EXIT.
039300*
039400*========================================================================
039500*  従業員情報修正処理
039600*
039700*（１）従業員選択画面を表示し，修正する従業員の従業員コードの入力を要求
039800*　　する。
039900*（２）入力されたＰＦキー毎の処理を行う。
040000*　・　ＰＦ２（終了キー）が入力されたならば，処理を終了するために，制御
040100*　　を出口に移行する。
040200*　・　ＰＦ３（確定キー）が入力されたならば，指定された従業員番号の従業
040300*　　員オブジェクトを獲得し，データ取得処理及び従業員情報修正画面処理を
040400*　　行う。
040500*========================================================================
040600 従業員情報修正処理         SECTION.
040700*
040800     INITIALIZE 画面データ.
040900     DISPLAY  従業員選択画面.
041000     ACCEPT   従業員選択画面.
041100*
041200     EVALUATE  状態キー
041300     WHEN      終了キー
041400         GO  TO  従業員情報修正処理出口
041500     WHEN      確定キー
041600         INVOKE  従業員管理－オブジェクト  "Get-member-info"
041700            USING  画面－従業員番号
041800                   画面－氏名
041900                   画面－郵便番号
042000                   画面－住所
042100                   画面－入社年月日
042200                   画面－退社年月日
042300                   画面－職級
042400                   画面－基本給
042500                   画面－特別手当
042600                   画面－時間外手当
042700                   画面－残業時間
042800            RETURNING  復帰値
042900         IF   復帰値  =  0
043000         THEN
043100             INITIALIZE 状態キー
043200             PERFORM  従業員情報修正画面処理
043300                     UNTIL  状態キー  =  終了キー  OR  確定キー
043400         END-IF
043500     END-EVALUATE.
043600*
043700 従業員情報修正処理出口.
043800     EXIT.
043900*
044000*========================================================================
044100*  従業員情報修正画面処理
044200*
044300*（１）従業員情報修正画面を表示し，情報の修正を要求する。
044400*（２）修正後入力されたＰＦキー毎の処理を行う。
044500*　・　ＰＦ２（終了キー）が入力されたならば，修正を無効とするために，何
044600*　　もせずに制御を出口に移行する。
044700*　・　ＰＦ３（確定キー）が入力されたならばデータ設定処理を行った後，修
044800*　　正前オブジェクトを修正後オブジェクトに入れ換える。
044900*========================================================================
045000 従業員情報修正画面処理         SECTION.
045100 従業員情報修正入力.
045200     DISPLAY  従業員修正画面.
045300     ACCEPT   従業員修正画面.
045400*
045500     EVALUATE   状態キー
045600     WHEN       終了キー
045700         GO  TO  従業員情報修正画面処理出口
045800     WHEN       確定キー
045900         INVOKE   従業員管理－オブジェクト  "Regist-member"
046000            USING    画面－従業員番号
046100                     画面－氏名
046200                     画面－郵便番号
046300                     画面－住所
046400                     画面－入社年月日
046500                     画面－退社年月日
046600                     画面－職級
046700                     画面－基本給
046800                     画面－特別手当
046900                     画面－時間外手当
047000                     画面－残業時間
047100            RETURNING  復帰値
047200
047300         IF  復帰値 NOT = 0  THEN
047400           MOVE  職級エラー  TO  画面－メッセージ
047500           GO TO  従業員情報修正入力
047600         END-IF
047700     END-EVALUATE.
047800*
047900 従業員情報修正画面処理出口.
048000     EXIT.
048100*
048200*========================================================================
048300*  給与情報参照処理
048400*
048500*（１）給与情報参照選択画面を表示し，参照する従業員の従業員コードの入力
048600*　　を要求する。
048700*（２）入力されたＰＦキー毎の処理を行う。
048800*　・　ＰＦ２（終了キー）が入力されたならば，処理を終了するために，制御
048900*　　を出口に移行する。
049000*　・　ＰＦ３（確定キー）が入力されたならば，指定さた従業員番号の従業員
049100*　　オブジェクトを獲得し，データ取得処理を行い，給与情報を表示する。
049200*========================================================================
049300 給与情報参照処理         SECTION.
049400*
049500     INITIALIZE 画面データ.
049600     DISPLAY  給与情報参照選択画面.
049700     ACCEPT   給与情報参照選択画面.
049800*
049900     EVALUATE  状態キー
050000     WHEN      終了キー
050100         GO  TO  給与情報参照処理出口
050200     WHEN      確定キー
050300         INVOKE  従業員管理－オブジェクト  "Get-salary"
050400                                    USING      画面－従業員番号
050500                                               画面－総支給
050600                                    RETURNING  復帰値
050700*
050800         IF  復帰値  =  0  THEN
050900             INVOKE  従業員管理－オブジェクト  "Get-member-info"
051000                USING  画面－従業員番号
051100                       画面－氏名
051200                       画面－郵便番号
051300                       画面－住所
051400                       画面－入社年月日
051500                       画面－退社年月日
051600                       画面－職級
051700                       画面－基本給
051800                       画面－特別手当
051900                       画面－時間外手当
052000                       画面－残業時間
052100             INITIALIZE 状態キー
052200             PERFORM  UNTIL  状態キー  =  終了キー
052300               DISPLAY  給与情報参照画面
052400               ACCEPT    給与情報参照画面
052500             END-PERFORM
052600             INITIALIZE 状態キー
052700         END-IF
052800     END-EVALUATE.
052900*
053000 給与情報参照処理出口.
053100     EXIT.
053200*
053300*========================================================================
053400*  住所録印刷処理
053500*
053600*（１）職級選択画面を表示し，職級の選択要求を行う。
053700*（２）選択されたＰＦキー毎の処理を行う。
053800*　・　ＰＦ２（終了キー）が入力されたならば，出口に制御を移行する。
053900*　・　ＰＦ３（確定キー）が入力されたならば，選択された職級に対する住所
054000*　　録の印刷処理を行う。
054100*========================================================================
054200 住所録印刷処理         SECTION.
054300*
054400     INITIALIZE 画面－職級選択.
054500     DISPLAY  職級選択画面.
054600     ACCEPT   職級選択画面.
054700*
054800     EVALUATE  状態キー
054900     WHEN      終了キー
055000         GO  TO  住所録印刷処理出口
055100     WHEN      確定キー
055200         INVOKE  従業員管理－オブジェクト  "Print-address"
055300            USING  画面－職級選択
055400     END-EVALUATE.
055500*
055600 住所録印刷処理出口.
055700     EXIT.
055800*
055900 END PROGRAM Main.
