000100* Copyright 1992-2015 FUJITSU LIMITED
000110 IDENTIFICATION DIVISION.
000200  PROGRAM-ID. SAMPLE8.
000300*
000400 ENVIRONMENT DIVISION.
000500  INPUT-OUTPUT SECTION.
000600   FILE-CONTROL.
000700     SELECT FILEDEMO
000800         ASSIGN       TO  "thangdeptrai.txt"
000810          ORGANIZATION IS LINE SEQUENTIAL.
000900*
001000 DATA DIVISION.
001100  FILE SECTION.
001200  FD  FILEDEMO.
001300  01  VALUE1     PIC X(5).
001400*
001500 PROCEDURE DIVISION.
001600**?i‚P?jˆó?üƒtƒ@ƒCƒ‹‚ðƒI?[ƒvƒ“‚µ‚Ü‚·?B
001700      OPEN OUTPUT FILEDEMO.
001800*
001900  MAINPRO.
002000**?i‚Q?j•W?€“ü—Í?æ‚©‚çƒf?[ƒ^‚ð“Ç‚Ý?ž‚Ý?Aˆó?ü‘•’u‚É?o—Í‚µ‚Ü‚·?B
002100**      "/END"‚ª“ü—Í‚³‚ê‚½‚ç?ˆ—?‚ð?I—¹‚µ‚Ü‚·?B
002200      ACCEPT VALUE1 FROM CONSOLE.
002300      IF VALUE1(1:FUNCTION LENG("/END")) = "/END"
002400        PERFORM ENDPRO
002410        EXIT PROGRAM.
002500      WRITE VALUE1.
002600      PERFORM MAINPRO.
002700*
002800  ENDPRO.
002900**?i‚R?jˆó?üƒtƒ@ƒCƒ‹‚ðƒNƒ??[ƒY‚µ‚Ü‚·?B
003000      CLOSE  FILEDEMO.
003100 END PROGRAM SAMPLE8.