000100* Copyright 1992-2015 FUJITSU LIMITED
000200      02  商品レコード.
000300          03  商品コード    PIC X(4).
000400          03  商品名        PIC N(20).
000500          03  単価          PIC 9(4)  BINARY.
