000100* Copyright 1992-2015 FUJITSU LIMITED
000200 01  売上レコード.
000300     02  商品コード   PIC X(4).
000400     02  売上日.
000500         03  年       PIC 9(4).
000600         03  月       PIC 9(2).
000700         03  日       PIC 9(2).
000800     02  数量         PIC 9(4).
000900     02  金額         PIC 9(5).
