000100**************************************************************************
000200**  Copyright 1999-2015 FUJITSU LIMITED
000300**
000400**    User-Info.cbl
000500**
000600**************************************************************************
000700 01  userInfo.
000800     02 userID                    pic X(32).
000900     02 userPassword              pic X(32).
