000860 IDENTIFICATION DIVISION.
000870
000880 PROGRAM-ID.  Daigay.
000890
000900 ENVIRONMENT DIVISION.
000910 INPUT-OUTPUT SECTION.
000920
000930 FILE-CONTROL.
000940
000950 		SELECT PRODUCTFILE ASSIGN TO "PRODUCTS.DAT"
000960
000970           ORGANIZATION IS LINE SEQUENTIAL.
001000
001010 DATA DIVISION.
001020
001030 FILE SECTION.
001040
001050 FD PRODUCTFILE.
001060 01 PRODUCT.
001070 88  END-OF-PRODUCTFILE  VALUE HIGH-VALUES.
001080 02  PRODUCT-ID       PIC X(4).
001090 02  PRODUCT-NAME		  PIC X(20).
001100 02  PRODUCT-PRICE      PIC 9(4).
001110 02  PRODUCT-AMOUNT     PIC 9(3).
001140
001141 WORKING-STORAGE SECTION.
001142 01 COST.
001143 		02 COST-PRODUCT PIC 9(9) VALUE 0.
001144 		02 COST-ALL PIC 9(10) VALUE 0.
001145 		02 COST-GROUP PIC 9(10) VALUE 0.
001146 01 COUNT-PRODUCT.
001147 		02 COUNT-ALL PIC 9(3) VALUE 0.
001148 		02 COUNT-ERROR PIC 9(3) VALUE 0.	
001149 		02 COUNT-NORMAL PIC 9(3).	
001150 01 CHECK-GROUP PIC X.
001151 01 SUM-PART PIC 9(10) VALUE 0.
001152 PROCEDURE DIVISION.
001160 MAIN-PROGRAM.
001161 		PERFORM MAIN-PROCESS
001162 		PERFORM DISPLAY-RESULT
001170		STOP RUN.
001180
001190 MAIN-PROCESS.
001200     OPEN INPUT PRODUCTFILE.
001210     READ PRODUCTFILE
001220         AT END SET END-OF-PRODUCTFILE TO TRUE
001230     END-READ
001231    
001239     
001240     PERFORM UNTIL END-OF-PRODUCTFILE
001250     ADD 1 TO COUNT-ALL
001251*     PERFORM COUNT-GROUP-FUNCTION
001252	   IF COUNT-ALL = 1	 THEN
001253	       MOVE PRODUCT-ID(1:1) TO CHECK-GROUP	
001256	   END-IF 
001257	   
001258	   IF PRODUCT-PRICE IS NUMERIC AND PRODUCT-AMOUNT IS NUMERIC THEN
001259	       MULTIPLY PRODUCT-PRICE BY PRODUCT-AMOUNT GIVING COST-PRODUCT
001260	       
001262	       IF CHECK-GROUP = PRODUCT-ID(1:1) THEN
001263	           ADD COST-PRODUCT TO COST-GROUP
001264	       ELSE
001265	       	   DISPLAY "                          GROUP-COST:" CHECK-GROUP SPACE COST-GROUP
001266	           MOVE PRODUCT-ID(1:1) TO CHECK-GROUP
001267	           MOVE COST-PRODUCT TO COST-GROUP
001268	       END-IF
001271	       
001272    	   DISPLAY PRODUCT-ID SPACE PRODUCT-NAME SPACE PRODUCT-PRICE 
001273    	   SPACE PRODUCT-AMOUNT SPACE COST-PRODUCT
001274    	 
001275    	   ADD COST-PRODUCT TO COST-ALL
001276	   ELSE
001277	   	   ADD 1 TO COUNT-ERROR
001278	   	   IF CHECK-GROUP NOT EQUAL PRODUCT-ID(1:1) THEN
001279	   	       DISPLAY "                          GROUP-COST:" CHECK-GROUP SPACE  COST-GROUP
001280	   	       MOVE PRODUCT-ID(1:1) TO CHECK-GROUP
001281	   	       MOVE 0 TO COST-GROUP
001283	   	       
001284	   	   END-IF
001287	       DISPLAY PRODUCT-ID SPACE PRODUCT-NAME " >>>>>> ERROR"
001288	   END-IF	
001289     
001290     READ PRODUCTFILE
001291             AT END SET END-OF-PRODUCTFILE TO TRUE
001292     END-READ
001293     
001294     END-PERFORM
001295     DISPLAY "                          GROUP-COST:" CHECK-GROUP SPACE  COST-GROUP
001300     CLOSE PRODUCTFILE.
001302     
001303     
001307 DISPLAY-RESULT.
001317 	   DISPLAY "                                            Total: " COST-ALL.
001327 	   DISPLAY "PRODUCT TOTAL:" COUNT-ALL .
001328 	   DISPLAY "PRODUCT ERROR :" COUNT-ERROR.
001329 	   SUBTRACT COUNT-ERROR FROM COUNT-ALL GIVING COUNT-NORMAL.
001330 	   DISPLAY "PRODUCT NORMAL :" COUNT-NORMAL.	
001331     
001362
001363 
001364 END PROGRAM Daigay.
001370