000100* Copyright 1992-2015 FUJITSU LIMITED
000200 01 ‰ï‹cŽºŽd—l TYPEDEF.
000300   02  ‰ï‹cŽº–¼                   PIC X(4).
000400   02  ’èˆõ                       PIC X(5).
000500   02  “àü                       PIC X(9).
000600   02  Ží—Þ                       PIC X.
