000100* Copyright 1992-2015 FUJITSU LIMITED
000200  01 —\–ñî•ñ TYPEDEF.
000300    02  —\–ñ”Ô†                   PIC S9(4) COMP-5.
000400    02  —\–ñŽÒ–¼                   PIC X(20).
000500    02  Š‘®                       PIC X(20).
000600    02  “àü                       PIC X(9).
000700    02  FILLER                     PIC X(5).
000800  01 —\–ñƒŠƒXƒg TYPEDEF.
000900    02  —\–ñ“ú                     PIC X(8).
001000    02  ‰ï‹cŽº–¼                   PIC X(4).
001100    02  ŽžŠÔ˜g                     PIC X(4).
001200    02  —\–ñŽÒŠÖ˜Aî•ñ             TYPE —\–ñî•ñ.
