000100* Copyright 1992-2015 FUJITSU LIMITED
000200 01 仕様リスト TYPEDEF.
000300   02  仕様名                     PIC X(4).
000400   02  性質１                     PIC X(5).
000500   02  性質２                     PIC X(9).
000600   02  性質３                     PIC X.
