000010 IDENTIFICATION  DIVISION.
000020 PROGRAM-ID.     OPENFORM.
000030 DATA            DIVISION.
000040 WORKING-STORAGE SECTION.
000050 01 DLLNAME      PIC X(260) VALUE "Debug\CopyData.dll".
000060 01 FORMNAME     PIC X(14)  VALUE "CopyForm".
000070 PROCEDURE       DIVISION.
000080* COBOLでの処理の途中、一時的にPowerCOBOLで作成したフォームを利用すること
000090* により、Windowsらしいアプリケーションが実現できます。
000100     CALL "POWEROPENFORM" USING DLLNAME FORMNAME
000110 END PROGRAM OPENFORM.
