000100 IDENTIFICATION DIVISION.
000110
000120 PROGRAM-ID.  demo.
000150
000160 ENVIRONMENT DIVISION.
000180 INPUT-OUTPUT SECTION.
000190
000200 FILE-CONTROL.
000210
000220 		SELECT StudentFile ASSIGN TO "STUDENTS.DAT"
000230
000240           ORGANIZATION IS LINE SEQUENTIAL.
000250
000260
000270
000280 DATA DIVISION.
000290
000300 FILE SECTION.
000310
000320 FD StudentFile.
000340 01 StudentRec.
000360 88  EndOfStudentFile  VALUE HIGH-VALUES.
000380 02  MSSV         PIC 9(3).
000400 02  HoTen.
000420     03 Surname        PIC X.
000440    03 Initials       PIC X.
000460 02  NgaySinh.
000480     03 YOBirth        PIC 9.
000500     03 MOBirth        PIC 9.
000520     03 DOBirth        PIC 9.
000540 02  MaMH        PIC X.
000560 02  Gender            PIC X.
000570
000580
000581 WORKING-STORAGE SECTION.
000582 01 THANGBK PIC X(111) VALUE "      122".
000583 01 CHECK PIC X VALUE  "t".
000584 01 SUM-XXX PIC X(23).
000585 
000590 PROCEDURE DIVISION.
000591 Begin.
000592
000600		STRING THANGBK DELIMITED BY SIZE
000610				CHECK DELIMITED BY SPACE
000611				INTO SUM-XXX
000612		END-STRING
000613		DISPLAY SUM-XXX.		
000620*	   OPEN OUTPUT StudentFile
000820
000830*     DISPLAY "Enter student details using template below."
000840
000841*     DISPLAY "Enter no data to end"
000842
000843	   
000844*	   DISPLAY "dddd " THANGBK(1:1)
000845	   
000846
000847*     PERFORM GetStudentRecord
000848*     PERFORM UNTIL StudentRec = SPACES
000849*     WRITE StudentRec
000850*     PERFORM GetStudentRecord
000851*     END-PERFORM
000852*     CLOSE StudentFile
000853
000854*     OPEN INPUT StudentFile.
000855*     READ StudentFile
000856*         AT END SET EndOfStudentFile TO TRUE
000860*     END-READ
000880*     PERFORM UNTIL EndOfStudentFile
000900*     DISPLAY MSSV SPACE HoTen SPACE MaMH
000920*     READ StudentFile
000940*             AT END SET EndOfStudentFile TO TRUE
000960*     END-READ
000980*    END-PERFORM
001000*    CLOSE StudentFile
001020     STOP RUN.
001040
001060 GetStudentRecord.
001080     DISPLAY "NNNNNNNSSSSSSSSIIYYYYMMDDCCCCG"
001110     ACCEPT  StudentRec.
001120 END PROGRAM demo.
001140