*>  Copyright 1992-2015 FUJITSU LIMITED
*>  この登録集は自由形式の正書法で記述されています。
 02  商品レコード.
     03  商品コード      PIC X(4).
     03                  PIC X(1).
     03  商品名          PIC N(20).
     03                  PIC X(1).
     03  単価            PIC 9(4)  DISPLAY.
