000010**************************************************************************
000020**  Copyright 2000-2015 FUJITSU LIMITED
000030**
000040**    SESSDATA.CBL
000050**
000060**************************************************************************
000070 01  SESSDATA.
000080     02 S-USERID                    PIC X(32).
000090     02 S-OLDBALANCE                PIC 9(16).
000100     02 S-TRADE                     PIC X(01).
000110        88 S-DEPOSIT                VALUE "0".
000120        88 S-REPAYMENT              VALUE "1".
000130     02 S-MONEY                     PIC 9(16).
000140     02 S-NEWBALANCE                PIC 9(16).
