000010*************************************************************************
000020**  Copyright 2000-2015 FUJITSU LIMITED
000030**
000040**    USER-INFO.CBL
000050**
000060*************************************************************************
000070 01  USERINFO.
000080     02 USERID                    PIC X(32).
000090     02 USERPASSWORD              PIC X(32).
